{
  "projects": [
    {
      "student_name": "Bobby B.",
      "mentor_name": "Tomer Arnon",
      "mentor_title": "MS Engineering at Stanford",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/d3d6a74d6a0a9bcd44c95072a47feb60bb27d7c8.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Predicting the Price of New York City Airbnbs",
      "project_desc": "How can one predict the price of a New York City Airbnb? We are trying to create a machine learning model that can predict the price of a NYC Airbnb given some factors with high accuracy. There are many factors that contribute to pricing an Airbnb. This model is important because it can help people list their Airbnb for a fair price and help a renter determine if a listing price is fair. We first found a dataset containing the price of New York City Airbnbs and many features about these houses. This dataset also contained many factors about the houses that could be important for predicting prices. We then condensed the data into only the data that we thought were important. We compared several regression models to see which would predict the price best. The random forest regressor predicted the price with about 27% away from the price on average. The SGD regression predicted the price with an error of about 42%. Our model wasn’t very accurate when predicting the price. To accurately predict the price, more factors about the housing are most likely needed. Some of these could be square footage, bathrooms, and bedrooms. Though, these weren’t on the dataset we used.",
      "research_paper": "assets/pdfs/86e08cacbf82fb0717d19671eae734ee4d7bffbc.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://vrmintel.com/wp-content/uploads/2022/03/shutterstock_1733117681-1000x600.jpg",
      "headline": "How can one predict the price of a New York City Airbnb? We are trying to create a machine learning model that can predict the price of a NYC Airbnb given some factors with high accuracy. ",
      "project_id": "9c6db7729f0bd3434f86a8496bbea560d83db38b",
      "expand": false,
      "tags": [
        "Economics",
        "New York",
        "Prediction"
      ],
      "related_proj": [
        14,
        66,
        60
      ]
    },
    {
      "student_name": "Milo B.",
      "mentor_name": "Samuel Kwong",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Classification of Exon and Intron Boundaries",
      "project_desc": "The goal was to accurately classify exon and intron boundaries based on DNA sequences. Scientists can learn more about proteins if divisions between exons and introns are clear. We used multiple different machine learning approaches including a logistic regression model, a multilayer perceptron, a LSTM, and a model that included a LSTM, autoencoder and a multilayer perceptron. LSTMs performed well, pointing to the idea that order of nucleotides is important when classifying DNA sequences.",
      "research_paper": "assets/pdfs/5e52f405b21ba1d699d6791a0af9798ec16b4a7d.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.news-medical.net/image.axd?picture=2018%2F11%2Fshutterstock_231128206.jpg",
      "headline": "The goal was to accurately classify exon and intron boundaries based on DNA sequences. Scientists can learn more about proteins if divisions between exons and introns are clear. We used multiple different machine learning approaches including a logistic regression model, a multilayer perceptron, a LSTM, and a model that included a LSTM, autoencoder and a multilayer perceptron. LSTMs performed well, pointing to the idea that order of nucleotides is important when classifying DNA sequences.",
      "project_id": "135ecb38979e957454d852cfe9e34cd39eee2ec6",
      "expand": false,
      "tags": [
        "Biology",
        "DNA",
        "LSTMs",
        "Logistic Regression"
      ],
      "related_proj": [
        22,
        74,
        39
      ]
    },
    {
      "student_name": "Elgin V.",
      "mentor_name": "Joseph Vincent",
      "mentor_title": "Aerospace Engineering PhD Candidate at Stanford",
      "mentor_image": "assets/images/mentor_imgs/7b7ea5005c74c69e40cdacd9a0d7b16c2822f5dc.png",
      "student_image": "assets/images/student_imgs/bc8b920d3e66bddeb3fb23064ca3ffd56f4a38ce.png",
      "domains": [
        "Sports and Motion Sciences"
      ],
      "project_title": "Predicting Running Injuries with Machine Learning Models",
      "project_desc": "Is it possible to predict running injuries with only a dataset and machine learning models? This paper explores this question by using classification models, including the Logistic Regression model and the Random Forest Classifier model. In the dataset used, ten features were taken into account when predicting running injuries. With slight modifications, the Weighted Logistic Regression and over and down-sampling Random Forest Classifier models were used to mitigate the imbalance in the dataset. The results suggested that the best model was Weighted Logistic Regression and that the best score metric to take into account was the F beta score.",
      "research_paper": "assets/pdfs/be88cd8430de161d40c89667573175ca23a8a90e.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.runtastic.com/blog/wp-content/uploads/2021/05/thumbnail_1200x800-2.jpg",
      "headline": "Is it possible to predict running injuries with only a dataset and machine learning models? This paper explores this question by using classification models, including the Logistic Regression model and the Random Forest Classifier model.",
      "project_id": "8f11c9cea7ec6c6ef1b452880aceade84635e612",
      "expand": false,
      "tags": [
        "Sports",
        "Running",
        "Logistic Regression"
      ],
      "related_proj": [
        16,
        6,
        6
      ]
    },
    {
      "student_name": "Deniz G.",
      "mentor_name": "Kush Khosla",
      "mentor_title": "MS Computer Science from Stanford, Lead Data Scientist at Retain.ai",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Education",
        "Humanitarian Efforts and Social Justice"
      ],
      "project_title": "The Impact of the Covid-19 Pandemic on the Test Scores of Various Demographics",
      "project_desc": "The research problem that this research paper attempts to address is, How did Covid impact and affect the test scores of different demographics of students in various schools in New York? This issue is significant for the following reasons. By the conclusion of the school year, students had an average of five months’ worth of math and four month’s worth of reading behind them, according to an analysis of the pandemic’s effects on K-12 student learning. For example, student testing in 2021 was about ten points behind in math and nine points behind in reading, compared with matched students in previous years. The pandemic expanded already-existing achievement and opportunity inequities, particularly harming historically underprivileged students. Children in low-income schools had seven months of unfinished arithmetic work at the end of the year, compared to six months for students in majority-Black schools. High school students are now more likely to drop out, and seniors, particularly those from low-income households, are less likely to continue their education after graduation. The crisis also had an effect on pupils’ general health and well-being, with more than 35% of parents expressing severe or great concern for their kids’ mental health. The effects of the epidemic pose a threat to the hopes and possibilities for this generation far into adulthood. Their chances of enrolling in college and subsequently securing a rewarding profession that allows them to sustain a family may be adversely affected by the knock-on effects. Furthermore, analysis indicates that the pandemic’s effects on schooling may result in today’s students earning $49,000 to $61,000 less in their lifetime unless measures are implemented to remedy unfinished learning. The overall approach that was used to answer this question involved using statistical analysis to examine the correlation between how certain factors such as being economically disadvantaged or being hispanic affected student proficiency scores on New York State regents exam tests in 2018 and 2021 in different schools. Some of the significant results that came out of this research paper involved certain demographics such as those who were economically disadvantaged and those who were white. Specifically, in relation to how their demographic correlated with their school’s percent proficiency difference in a subject exam between the years 2018 and 2021. For example, 100% of the students of the Academy for Language and Technology are economically disadvantaged and compared to 2021, the number of students who were proficient in English dropped by 49%. Furthermore, 72% of Akron High school’s students are economically disadvantaged and compared to 2021, the number of students who were proficient in English dropped by 68%. However, on the other side of the spectrum, students of white descent did not fare as badly. For instance, Adirondack Middle School has an approximate demographic makeup of 100% white students. Their student’s percent proficiency when it came to their Algebra I score did not change at all. Additionally, Yonkers Montessori Academy has a demographic makeup where 46% of its students are white. The students from this school showed a 5% increase in their proficiencies in their science scores. The research that was conducted as the basis for this paper was done in an effort to examine the COVID-19 pandemic’s effects on student performance across various schools in New York. Specifically, it affected some demographics disproportionately when compared to others. Due to students being forced to learn from home, some without the necessary technology and adequate resources. Consequently, a lot of students took a significant hit to their academic progress. For instance, 100% of a student’s demographic make up is economically disadvantaged and out of these students, 49% of them were no longer proficient in ELA after the COVID-19 pandemic. Whereas, students of white descent did not fare as badly.  For instance, Adirondack Middle School has an approximate demographic makeup of 100% white students. Their student’s percent proficiency when it came to their Algebra I score did not change at all.",
      "research_paper": "assets/pdfs/e8d80e23bb221e30b11b74806ba7ab11dcd7ac0a.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTu1QsK4minVxl1ddZ7leeN_hYkVq4-EHb6QFg1A1_gpQ&usqp=CAU&ec=48665701",
      "headline": "The research problem that this research paper attempts to address is, How did Covid impact and affect the test scores of different demographics of students in various schools in New York? The overall approach that was used to answer this question involved using statistical analysis to examine the correlation between how certain factors such as being economically disadvantaged or being hispanic affected student proficiency scores on New York State regents exam tests in 2018 and 2021 in different schools.",
      "project_id": "cf9350cead2fe96bbfaf975fb68dd1f94d126b3e",
      "expand": true,
      "tags": [
        "Education",
        "COVID-19",
        "Racial Equality",
        "Inequality",
        "Wage Gap",
        "Gender Equality",
        "New York"
      ],
      "related_proj": [
        49,
        80,
        13
      ]
    },
    {
      "student_name": "Serena F.",
      "mentor_name": "Clayton Greenberg",
      "mentor_title": "Teaching Professor from UPenn",
      "mentor_image": "assets/images/mentor_imgs/386ead2265f41608f1d70e611d406f8eb3916841.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Arts and Music",
        "Engineering"
      ],
      "project_title": "Brightness helps CNN classify a subset of the images from Google Quick Draw",
      "project_desc": "We made a CNN that learned to recognize and classify sketches from Google’s Quick Draw dataset and implemented a novel brightness feature to test if it increased the accuracy. The results displayed up to a 4% increase in validation accuracy. To conduct experiments, we created 3 models, 1 with brightness and two without. In addition, we used different numbers of epochs, metalayers, kernels, and sizes of kernels and dropouts. ",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.labnol.org/images/2023/google-drive-drawings.jpg",
      "headline": "We made a CNN that learned to recognize and classify sketches from Google’s Quick Draw dataset and implemented a novel brightness feature to test if it increased the accuracy.",
      "project_id": "eb405932a81ebf0ee021c4d7110eb79a8be94072",
      "expand": false,
      "tags": [
        "Google",
        "Visual Arts",
        "CNNs",
        "Classification"
      ],
      "related_proj": [
        11,
        30,
        13
      ]
    },
    {
      "student_name": "Neal D.",
      "mentor_name": "Clayton Greenberg",
      "mentor_title": "Teaching Professor from UPenn",
      "mentor_image": "assets/images/mentor_imgs/386ead2265f41608f1d70e611d406f8eb3916841.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Cybersecurity"
      ],
      "project_title": "Identifying EOL software",
      "project_desc": "Throughout our project, we have been exploring ways to identify EOL and malicious websites using python. With this software, we can help people stay away from these types of websites. There are lots of cybersecurity problems in the world, but we wanted to address the EOL problem because it is something that is within the realm of what we are learning (language recognition), and it has a practical use in the world. We used multiple different commands to identify certain “keywords,” with the intention of getting the highest possible accuracy percentage. We also prioritized the elimination of false negatives over false positives. Creating a new variable with the keywords, we were able to correctly predict 99% of the EOL websites using the data given to us. We were able to conclude that mixing the 2 most important data columns and creating one variable to determine both of the variables is the best way to go about creating a variable that gives you the most.",
      "research_paper": "assets/pdfs/d34a47e0378e43f257434214043f08ba4ac4aaee.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://auxzillium.com/wp-content/uploads/2019/07/eol-image-WINDOW-7-1030x504.jpg",
      "headline": "Throughout our project, we have been exploring ways to identify EOL and malicious websites using python. Creating a new variable with the keywords, we were able to correctly predict 99% of the EOL websites using the data given to us.",
      "project_id": "2e33ac90723516d3347d5bd42fabc3f4163edd87",
      "expand": false,
      "tags": [
        "Natural Language Processing",
        "EOL",
        "Web Development"
      ],
      "related_proj": [
        67,
        46,
        50
      ]
    },
    {
      "student_name": "Chinmay R.",
      "mentor_name": "Amanda Wang",
      "mentor_title": "MS in Computer Science, Computer Science and Business Analytics MIT Alum",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Physics"
      ],
      "project_title": "Using Machine Learning to Classify  Stars, Quasars, and Galaxies ",
      "project_desc": "In this project, we looked at data from stars, quasars, and galaxies from the sixteenth data release of the Sloan Digital Sky Survey Telescope. The aim of the project was to accurately and quickly classify these three types of objects using machine learning. We used three machine learning algorithms, namely logistic regression, multi-layer perceptron, and  decision tree classifier. The classification was done based on measurements of the object’s redshift and its u,g,r,i, and z light emissions. Logistic regression offered the least accurate results, with an overall accuracy of 94.83%, and a runtime of 28.2 seconds. Better in both aspects was the decision tree classifier, with an overall accuracy of 98.90%, and a runtime of 6.36 seconds. Several structures with different kinds of neuron-layer arrangements were tried for the MLP classifier. While all yielded around a 98% total accuracy, the more complex a structure was, or the more nodes and layers it had, the more time it took to run, and none even came close to the low amount of time taken by the decision tree classifier.\n",
      "research_paper": "assets/pdfs/8d1a6c6dcdfa827dfa8e15714053c5ea70b13af9.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://imageio.forbes.com/specials-images/imageserve/6448c936e1113d7182a3babe/Artist-s-rendering-of-quasar-P172-18--credit--ESO-M-Kornmesser--higher-res--1-/960x0.jpg?format=jpg&width=960",
      "headline": "In this project, we looked at data from stars, quasars, and galaxies from the sixteenth data release of the Sloan Digital Sky Survey Telescope. The aim of the project was to accurately and quickly classify these three types of objects using machine learning. We used three machine learning algorithms, namely logistic regression, multi-layer perceptron, and  decision tree classifier. ",
      "project_id": "88fdc975a0663bc34d05cc15d62b26f5e1807526",
      "expand": false,
      "tags": [
        "Astronomy",
        "Stellar Classification",
        "Logistic Regression",
        "Classification"
      ],
      "related_proj": [
        36,
        56,
        52
      ]
    },
    {
      "student_name": "Rayyan M.",
      "mentor_name": "Philip Bell",
      "mentor_title": "Computer Science MS from Georgia Tech, Harvard and Oxford alum, AI Engineer at Cognino ",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/19f59a6417431b5e1507ccea4a6c84bbe58a95ff.png",
      "domains": [
        "Environment",
        "Journalism"
      ],
      "project_title": "Combating Climate Fake News Using NLP",
      "project_desc": "As fake news becomes more prevalent across the US, important issues become harder to solve. One such issue is climate change, where climate misinformation has worsened viewer’s abilities to distinguish between fake information and real information. This project’s objective is to tackle climate misinformation using an artificial intelligence model. The model utilizes a BERT model tested on the “climate_fever” dataset to classify whether climate-related claims are true based on pieces of evidence.",
      "research_paper": "assets/pdfs/d80b43b85a066c44470644a3696aca2d9ecfac57.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "github": "https://github.com/SpicyTaco17/Climate-Fake-News",
      "project_webpage": "https://spicytaco17-climate-fake-news-app-57cfkv.streamlit.app/",
      "graphic_link": "https://media-cldnry.s-nbcnews.com/image/upload/newscms/2018_25/2470661/189619-weather-forecasting-mn-1620.jpg",
      "headline": "As fake news becomes more prevalent across the US, important issues become harder to solve. One such issue is climate change, where climate misinformation has worsened viewer’s abilities to distinguish between fake information and real information. This project’s objective is to tackle climate misinformation using an artificial intelligence model.",
      "project_id": "1dbfe39aa305fa7f40158cb17cd70a167c56d275",
      "expand": false,
      "tags": [
        "News",
        "Fake News",
        "Climate Change",
        "Natural Language Processing"
      ],
      "related_proj": [
        26,
        27,
        59
      ]
    },
    {
      "student_name": "Yudhiishbala V.",
      "mentor_name": "Ana Sofia Muñoz Valadez",
      "mentor_title": "Mentor consent not given",
      "mentor_image": "assets/images/mentor_imgs/a8741ef839f967cc56ad99d15d117998827e1d41.png",
      "student_image": "assets/images/student_imgs/b56adeba165b1122e749145cf648a7865b6c0e86.png",
      "domains": [
        "PoliSci and Law"
      ],
      "project_title": "AI Models Necessary to Reduce Racism in Criminal Justice In The United States of America",
      "project_desc": "As this project commenced, I first focused on gaining some general knowledge about the applications of Artificial Intelligence. As I went through this, I ended up choosing The main focus of this project was to figure out which kind of AI model is best for use in a court setting or the criminal justice system.The goal was to ensure the AI model is accurate and free of skewed/biased data. Throughout this research project, three different regression models are looked at in order to narrow down the most accurate models. This research found that the AI models that can provide the most accurate results are DecisionTreeRegressor, MLPRegressor, and BaggingRegressor. As this research project commenced, it was shown that the BaggingRegressor method enables programmers to train artificial intelligence systems to make decisions in the most accurate manner possible, with the margin of errors and biases decreasing by almost 82% from the MLPRegressor.",
      "research_paper": "assets/pdfs/0c25a65e391d1ca6d60de881e00e9b37dd37a931.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://i0.wp.com/www.goodwin.edu/enews/wp-content/uploads/2022/03/Benefits-of-a-Criminal-Justice-Degree_mast-tiny.jpg?fit=1920%2C1280&ssl=1",
      "headline": "The goal was to ensure the AI model is accurate and free of skewed/biased data. Throughout this research project, three different regression models are looked at in order to narrow down the most accurate models.",
      "project_id": "c074529d01f1911b9dead55c4b7171d4168250c2",
      "expand": true,
      "tags": [
        "Criminal Justice",
        "Law and Order",
        "Racial Equality"
      ],
      "related_proj": [
        64,
        15,
        46
      ]
    },
    {
      "student_name": "Viksar D.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/student_imgs/cec0f803c2c639e499c49ffe1b9d12d759a8f2e1.png",
      "domains": [
        "Education"
      ],
      "project_title": "Predicting Dropouts Using Machine Learning Models",
      "project_desc": "High dropout rates in high schools and universities have become a major complication in many countries following the upsurge of the Covid 19 pandemic. A student’s experience at school is one of, if not, the largest contributors to the likelihood that they drop out. However, with the growing quantity of students in school, and the sheer variety of those who drop out, manually pinpointing possible dropouts becomes extremely challenging. Therefore, by using a machine learning model, administrators would be able to more efficiently identify a possible dropout and provide the necessary resources to ensure their success. The data, acquired from the UCI Machine Learning Depository, had 24 inputs, and 3630 samples. For this particular project, Logistic Regression, K-Nearest Neighbors, Naive Bayes, Extra Trees Classifier, and an MLP Neural Network models were tested. Among these models, the most accurate was the Extra Trees Classifier model, with a percentage accuracy of 77.41%, a loss of 7.85, and an F1 score of 82.35%. With the accuracy provided, this model should be held in high regard as it serves as an efficient method for predicting possible college dropouts in university.",
      "research_paper": "assets/pdfs/b545fd268b01bf9a88c99db2620adce4ac66f5b0.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "project_webpage": "http://6bad-34-91-124-160.ngrok.io/",
      "graphic_link": "https://static01.nyt.com/images/2018/05/25/opinion/25leonhardt-newsletter/merlin_35629513_5bc654be-2bee-42b7-b203-8a443cd862eb-superJumbo.jpg",
      "headline": "High dropout rates in high schools and universities have become a major complication in many countries following the upsurge of the Covid 19 pandemic. With the accuracy provided, this model should be held in high regard as it serves as an efficient method for predicting possible college dropouts in university.",
      "project_id": "d390a53d3c26a270b7cd24698fc9696b884b86ea",
      "expand": false,
      "tags": [
        "Education",
        "COVID-19",
        "Dropout Rates",
        "Logistic Regression"
      ],
      "related_proj": [
        33,
        73,
        19
      ]
    },
    {
      "student_name": "Christopher G.",
      "mentor_name": "Sean Konz",
      "mentor_title": "Computer Science MS from Stanford, Software Engineer",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/04ffa4f0de734465c7afe0d0844dfc16ac297e5d.png",
      "domains": [
        "Language and Literature"
      ],
      "project_title": "Generation of Research Paper Titles",
      "project_desc": "Can NLP accurately and effectively generate research paper titles? In this research paper, an effective and accurate artificial intelligence NLP model is tried to be determined by evaluating various models and methods for title generation. Titles are a vital part of any work. People tend to struggle to find good titles for their work, including researchers. A title must be representative of the whole paper and its topic, so it must be carefully chosen. Titles are the main reason people read a paper, so it’s very important to attract the audience of the researcher. Apart from this, normalizing research paper titles with generated ones can eliminate bias and exaggeration from them. To determine an accurate and effective model, various methods for title generation were tested given the abstract of a research paper. The methods tested vary from very simple, like “bag of words”, to complex with GPT-2. The best result was getting a sentence similarity of 0.9032, which was 66% higher than the initial model. Through this project it is confirmed that generating good titles with NLP is a hard task, but the results from the models can facilitate the process of creating a good and compact research paper title.",
      "research_paper": "assets/pdfs/71074e8b5e6842508b82111d5b48adabaeca6d08.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "github": "https://github.com/cgossmann05/research-paper-title-generation",
      "graphic_link": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQD4fPz0UVShi0FJ6j8_ApzNM99E6LGl9m9Wn-lyjbalw&usqp=CAU&ec=48665701",
      "headline": "Can NLP accurately and effectively generate research paper titles? In this research paper, an effective and accurate artificial intelligence NLP model is tried to be determined by evaluating various models and methods for title generation. ",
      "project_id": "de4b0165aff73fddc32d35a35376d1647cd002f8",
      "expand": false,
      "tags": [
        "Natural Language Processing",
        "Generative AI",
        "GPT-3"
      ],
      "related_proj": [
        18,
        35,
        15
      ]
    },
    {
      "student_name": "Vincent P.",
      "mentor_name": "Amanda Wang",
      "mentor_title": "MS in Computer Science, Computer Science and Business Analytics MIT Alum",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance",
        "Arts and Music"
      ],
      "project_title": "Analysis of Trending YouTube Videos: Finding Patterns in Viral Content",
      "project_desc": "As the digital world continues to grow, content creators frequently have trouble building a community and producing videos that will interest their audience.  Especially as these people look toward the internet for both recreational and monetary reasons, finding out techniques to build a community is important in today’s age. This paper analyzes the issues of video performance, revealing the patterns of what makes a video successful and viral. By training different models and testing different datasets, we were able to find the correlation between the potential chances of popularity and the video’s content. Using the most accurate model, the Random Forest model, content creators can see whether or not they are likely to do well based on patterns found in trending videos. ",
      "research_paper": "assets/pdfs/c283911c7c3a2f4a066583c76fef8f34767b6412.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.cnet.com/a/img/resize/55f2ab60e25d1ec7e18c4290c93e6e27300c8cc6/hub/2020/01/01/301595b2-19b5-4399-94a2-718b3e3ed15c/youtube-logo-laptop-4692.jpg?auto=webp&fit=crop&height=675&width=1200",
      "headline": "As the digital world continues to grow, content creators frequently have trouble building a community and producing videos that will interest their audience. Especially as these people look toward the internet for both recreational and monetary reasons, finding out techniques to build a community is important in today’s age. This paper analyzes the issues of video performance, revealing the patterns of what makes a video successful and viral. By training different models and testing different datasets, we were able to find the correlation between the potential chances of popularity and the video’s content. Using the most accurate model, the Random Forest model, content creators can see whether or not they are likely to do well based on patterns found in trending videos.",
      "project_id": "cc8726745726dab5f9cfc29ff8712b4823648242",
      "expand": false,
      "tags": [
        "Pop Culture",
        "Social Media",
        "Random Forests"
      ],
      "related_proj": [
        53,
        30,
        17
      ]
    },
    {
      "student_name": "Arnav D.",
      "mentor_name": "Nic Thibodeaux",
      "mentor_title": "Mentor consent not given",
      "mentor_image": "assets/images/mentor_imgs/a8741ef839f967cc56ad99d15d117998827e1d41.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology",
        "Published Papers"
      ],
      "project_title": "The Differentiation of Viral and Bacterial Pneumonia using Deep Learning",
      "project_desc": "This project aims to find out whether a Convolutional Neural Network can be used to classify x-ray scans as having either bacterial or viral Pneumonia. First, its use is discussed, as it is meant to be used to assist with pulmonary healthcare in underprivileged areas. Then, its structure is outlined as a CNN set up using Keras and Tensorflow that is trained on a dataset consisting of 5856 x-ray scans of patients one to five years old from Guangzhou Women and Children’s Medical Center. After testing multiple setups, the final model, based on Inception ResNet v2, differentiates between the two types of Pneumonia with a 75% test accuracy, using minimal epochs in order to increase efficiency. The model was further improved by using dropout, the implementation of early stopping, L2 regularization and augmentation of the training data in order to combat overfitting. Lastly, the model’s limitations and future are discussed. This model proves one can predict and identify types of Pneumonia using a CNN with relatively high accuracy and shows the potential of deep learning in the context of medical imaging to assist medical staff.",
      "project_yr": "2022",
      "project_quarter": "Fall",
      "graphic_link": "https://thorax.bmj.com/content/thoraxjnl/57/5/438/F1.large.jpg",
      "headline": "This project aims to find out whether a Convolutional Neural Network can be used to classify x-ray scans as having either bacterial or viral Pneumonia. ",
      "project_id": "58dec3622ea48a99256e07cb547de3f8418e0c94",
      "expand": false,
      "tags": [
        "Diseases and Health Conditions",
        "Pneumonia",
        "Classification",
        "Published"
      ],
      "related_proj": [
        63,
        37,
        69
      ]
    },
    {
      "student_name": "Khondoker F.",
      "mentor_name": "Barbie Duckworth",
      "mentor_title": "Computer Science BS Alumni MIT, prior Software Engineer at Facebook and eBay",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/8004f9d9a0db1f1ec74dd2a6cda6aaa8bfc701aa.png",
      "domains": [
        "Engineering",
        "Humanitarian Efforts and Social Justice"
      ],
      "project_title": "DeepSolar Bangladesh: A Novel Convolutional Neural Network (CNN) Architecture for the Detection of Solar Panels from Low Resolution Satellite Imagery in Developing Countries",
      "project_desc": "Due to its environmental benefits and decreasing costs, the supply of solar energy is growing at an accelerating pace globally. However, the decentralised nature of solar makes it difficult to keep track of the different photovoltaic (PV) systems deployed across a country. There is a critical need for highly accurate, comprehensive national databases of solar systems, which would allow policymakers, researchers, and the government to study socioeconomic trends in solar deployment. Manual surveys have shown to be inaccurate. The 2018 DeepSolar study by Yang et. al developed a deep-learning framework and national solar deployment database for the US using high-quality satellite imagery, which proved to be a much more efficient and accurate approach. However, satellite imagery in developing countries such as Bangladesh is of much lower resolution and quality, and performed poorly with the original DeepSolar model by Yang et. al. Our study highlights the implementation of a novel convolutional neural network (CNN) in detecting solar panels through low resolution Google Static Maps API satellite imagery data. The model was trained over 500 epochs and had 49,859,906 parameters, and classified image samples as positive (indicating presence of solar panels) or negative (absence of solar panels). Our accuracy was 86.49%, F1 score was 86.49%, precision was 91.95%, and recall score was 81.63%, which are comparable scores to the original DeepSolar CNN that was trained on much higher quality data. This was the first CNN to detect solar panels using low-resolution satellite imagery (which is usually the only option for developing countries), and showed to be highly accurate and computationally efficient. Future plans include gathering funding to be able to purchase Google API satellite imagery to be able to cover all of Bangladesh to create a comprehensive public national database, as well as expanding to other developing countries.",
      "research_paper": "assets/pdfs/868b76e02b4b9ebab1a8e8335b806122bcb679ce.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.pv-magazine.com/wp-content/uploads/2021/04/Bild1-1-1200x563.jpg",
      "headline": "Due to its environmental benefits and decreasing costs, the supply of solar energy is growing at an accelerating pace globally. However, the decentralised nature of solar makes it difficult to keep track of the different photovoltaic (PV) systems deployed across a country. There is a critical need for highly accurate, comprehensive national databases of solar systems, which would allow policymakers, researchers, and the government to study socioeconomic trends in solar deployment. Manual surveys have shown to be inaccurate. The 2018 DeepSolar study by Yang et. al developed a deep-learning framework and national solar deployment database for the US using high-quality satellite imagery, which proved to be a much more efficient and accurate approach. However, satellite imagery in developing countries such as Bangladesh is of much lower resolution and quality, and performed poorly with the original DeepSolar model by Yang et. al. Our study highlights the implementation of a novel convolutional neural network (CNN) in detecting solar panels through low resolution Google Static Maps API satellite imagery data.",
      "project_id": "4777f1633b5a64e6b806fbb637962cdb73afde74",
      "expand": true,
      "tags": [
        "Earth Systems",
        "Renewable Energy",
        "Satellite Imagery",
        "Solar Power"
      ],
      "related_proj": [
        23,
        38,
        4
      ]
    },
    {
      "student_name": "Ayrton S.",
      "mentor_name": "Bryce Johnson",
      "mentor_title": "Computer Science Stanford Alum, Industry Data Analytics and Business Consultant at Oliver Wyman",
      "mentor_image": "assets/images/mentor_imgs/25cd6897de1225f0749b35c056fee4a35783e102.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Predicting Repeat Purchases in E-Commerce",
      "project_desc": "As companies move their business online, the e-commerce space continues to develop as a rapidly growing industry. Marketing and upselling are crucial aspects of profitability. Therefore the objective of this investigation is to determine how the price, along with other features, of items sold on Amazon affect the likelihood of a customer making a repeat purchase. The underlying problem here is identifying more efficient upselling strategies for retailer companies. These findings may potentially help a retail company determine the likelihood of a customer purchasing another item based on their first purchase, and then decide how to upsell based on that information. Customer behavior and motivation is a crucial aspect of repeat purchases and original purchases in general, this notion has to be understood before attempting to answer the question. Identifying which features held the most weight in predicting repeat purchases was also a crucial aspect in determining if customers will buy again. In general it could be deduced that price, product brand, and product rating carry a great deal of weight when it comes to customer’s making repeat purchases.",
      "research_paper": "assets/pdfs/4de402cc2048bee6f7bd4a7b943d10f80d5e8d00.pdf",
      "graphic_link": "https://store.hp.com/app/assets/images/uploads/prod/ecommerce-vs-online-marketplace1603983748724190.jpg",
      "headline": "The underlying problem here is identifying more efficient upselling strategies for retailer companies. These findings may potentially help a retail company determine the likelihood of a customer purchasing another item based on their first purchase, and then decide how to upsell based on that information.",
      "project_id": "acf2bdaf2675d101299af10dc1b6e5d411d0f085",
      "expand": false,
      "tags": [
        "Economics",
        "Consumer Behavior"
      ],
      "related_proj": [
        25,
        50,
        66
      ]
    },
    {
      "student_name": "Aman B.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/student_imgs/445183ce0f1f5dfc55ae5dda695b9fd3005958f8.png",
      "domains": [
        "PoliSci and Law",
        "Language and Literature"
      ],
      "project_title": "Building an Optimized algorithm that provides summaries of legal documents",
      "project_desc": "We analyze the accuracy of various NLP algorithms in providing text summarization and fine-tune a particular model on a dataset to provide accurate text summaries of legal documents. The legal industry is built around documents as they provide evidence and reduce doubt in the court. Due to the large volume of documentation in the legal industry, the processing and summarization of these documents is important to a number of individuals. For example, lawyers, clients and professionals may need access to summaries of the documents for reference to similar cases. In this paper, we have developed an algorithm that trains the T5 model on the legal domain in order to create more accurate summaries of legal documents. We were able to create a user interface that allows for the input of documents and makes use of the algorithm we created to output a summary of the document which can be copied by the user.",
      "research_paper": "assets/pdfs/3eec95bc01e8a7ab3ad6093aa2ffb69309459447.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "github": "https://github.com/aman8533/Building-an-Optimized-algorithm-that-provides-summaries-of-legal-documents",
      "graphic_link": "https://scitechdaily.com/images/Legal-Document-Concept.jpg",
      "headline": "The legal industry is built around documents as they provide evidence and reduce doubt in the court. Due to the large volume of documentation in the legal industry, the processing and summarization of these documents is important to a number of individuals. We were able to create a user interface that allows for the input of documents and makes use of the algorithm we created to output a summary of the document which can be copied by the user.",
      "project_id": "de8eddad7c2dad6d67decd1f64ce8124032c2129",
      "expand": false,
      "tags": [
        "Law and Order",
        "Natural Language Processing"
      ],
      "related_proj": [
        35,
        27,
        10
      ]
    },
    {
      "student_name": "Marco Y.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Sports and Motion Sciences"
      ],
      "project_title": "Application of AI to Tennis Match Footage Transcription",
      "project_desc": "One of the best ways for tennis players to improve their game is to\nrecord and watch their own match footage, find patterns in the points\nthey win and lose, and practice based on these realizations. However,\nwatching match footage and documenting each point shot by shot is a\nvery time-consuming process. This paper investigates an AI approach to\ntranscribing tennis match footage, combining a deep convolution neural\nnetwork (YOLOv4), a pose estimation model (Movenet), and a long short-\nterm memory (LSTM) deep neural network. Looking at a transcript of\neach point will be far more efficient than watching entire match footage\nfor a player to understand how they are losing and winning and analyze\npatterns in their game. The LSTM model in this project achieved accura-\ncies of 73.33% and 79.31% when classifying shot type (forehand, forehand\nvolley, forehand slice, backhand, backhand volley, backhand slice, over-\nhead/smash, and serve) for players on the close side and opposite side\nof the net, respectively, and 55.17% and 60.00% when classifying the di-\nrection of a shot (cross-court, down the line, down the middle, inside in,\ninside out, out wide, down the t, and body) for players on the close side\nand opposite side of the net, respectively.\n1 Introduction\n1.1 Motivation\nAs a competitive junior tennis player, I sit down with a notebook after the match\nand watch my game footage. Documenting what happens in each point shot by\nshot is critical for players trying to improve their game. By analyzing match\nfootage a player can realize specifically what they need to work on to play better\nduring their next tournament, whether that is a shot, pattern, or tendency. For\nexample, if a player notices that he or she is losing a lot of points with long,\nforehand cross-court rallies, he or she can train the forehand cross-court shots.\nTennis match transcription is not just important to players at the amateur and\nprofessional level who are trying to improve, but also to research in the field\nof tennis analytics, as generating information for tennis matches is the first\n1\n",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://img.olympicchannel.com/images/image/private/t_s_pog_staticContent_hero_xl_2x/f_auto/primary/weyzoz6o394sxfkbest9",
      "headline": "One of the best ways for tennis players to improve their game is to record and watch their own match footage, find patterns in the points they win and lose, and practice based on these realizations. However, watching match footage and documenting each point shot by shot is a very time-consuming process. This paper investigates an AI approach to transcribing tennis match footage, combining a deep convolution neural network (YOLOv4), a pose estimation model (Movenet), and a long short- term memory (LSTM) deep neural network. Looking at a transcript of each point will be far more efficient than watching entire match footage for a player to understand how they are losing and winning and analyze patterns in their game. The LSTM model in this project achieved accura- cies of 73.33% and 79.31% when classifying shot type (forehand, forehand volley, forehand slice, backhand, backhand volley, backhand slice, over- head/smash, and serve) for players on the close side and opposite side of the net, respectively, and 55.17% and 60.00% when classifying the di- rection of a shot (cross-court, down the line, down the middle, inside in, inside out, out wide, down the t, and body) for players on the close side and opposite side of the net, respectively.",
      "project_id": "97a5b129fe54fbe0de6a6e5cf0be48752691b5df",
      "expand": false,
      "tags": [
        "Sports",
        "LSTMs"
      ],
      "related_proj": [
        2,
        78,
        59
      ]
    },
    {
      "student_name": "Aryaman R.",
      "mentor_name": "Yuan Lee",
      "mentor_title": "EECS MEng from MIT",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Approaches to fraud detection on credit card transactions using artificial intelligence methods",
      "project_desc": "In this paper, we study the problem of detecting fraudulent credit card transactions. We select the most relevant features using a heuristic approach, and fit three different model classes to a simulated dataset: Logistic Regression, Random Forests and Gradient Boosting Machines. We find that hyperparameter tuning has a big impact on the precision and recall of our classifiers. We also find that of the three classes, Gradient Boosting Machines were the best-performing model class, achieving 83% precision and 64% recall on unseen data.",
      "research_paper": "assets/pdfs/0cdd8a9fe0af140bea1a08e1b3255da866789f3b.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.incharge.org/wp-content/uploads/2019/12/credit-card-fraud.png",
      "headline": "In this paper, we study the problem of detecting fraudulent credit card transactions. We select the most relevant features using a heuristic approach, and fit three different model classes to a simulated dataset: Logistic Regression, Random Forests and Gradient Boosting Machines. We find that hyperparameter tuning has a big impact on the precision and recall of our classifiers. We also find that of the three classes, Gradient Boosting Machines were the best-performing model class, achieving 83% precision and 64% recall on unseen data.",
      "project_id": "a56ab8773f5c9ee799a933a83bb78a4f62887aa4",
      "expand": true,
      "tags": [
        "Economics",
        "Consumer Behavior",
        "Fraud"
      ],
      "related_proj": [
        53,
        66,
        25
      ]
    },
    {
      "student_name": "Parinita K.",
      "mentor_name": "Philip Bell",
      "mentor_title": "Computer Science MS from Georgia Tech, Harvard and Oxford alum, AI Engineer at Cognino ",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Psychology",
        "Language and Literature"
      ],
      "project_title": "Can A Person’s MBTI Type Be Determined By A Sample Of Their Writing?",
      "project_desc": "Personality typology, in this case MBTI, can give us great insight into how a person thinks and operates and what motivates that person’s decisions.  Although typology is most commonly seen in pop psychology and used for fun, typing backed by more empirical evidence and less by self-reported answers, which rely solely on the self-awareness and unbiasedness of the person, could give a more accurate insight into how people fit into the theory of cognitive functions, which MBTI is based on.  This project aims to lessen the reliance of self-report for personality typology through an artificial intelligence algorithm that can type people as one of the 16 MBTI types using an unedited writing sample by that person. The model used in this project is a transformer model, and the dataset used is a Kaggle dataset consisting of 8000 people’s personality types and 50 written samples from each person. The results are presented through a Streamlit app that uses the model to assign a personality type according to inputted text.  The accuracy measured while testing this model is approximately 57.64%, which means the model correctly classified over half the text samples it was tested on.  This indicates that there is a pattern that the model is picking up on, other than complete chance, that connects a person’s writing to their MBTI type. However, the writing is not 100% predictive of the person’s personality type.",
      "research_paper": "assets/pdfs/35877f904befc83aa323dff783b495dd8231787f.pdf",
      "graphic_link": "https://storage.googleapis.com/kaggle-datasets-images/1831626/2988740/27fb5342b4c3cd9e782015d7b791bb87/dataset-cover.png?t=2021-12-30-19-31-49",
      "headline": "This project aims to lessen the reliance of self-report for personality typology through an artificial intelligence algorithm that can type people as one of the 16 MBTI types using an unedited writing sample by that person.",
      "project_id": "ded1e42ec9ef421c5cd42fdacb594176a55a3139",
      "expand": false,
      "tags": [
        "Pop Culture",
        "Psych",
        "Writing"
      ],
      "related_proj": [
        21,
        45,
        73
      ]
    },
    {
      "student_name": "Emily J.",
      "mentor_name": "Philip Bell",
      "mentor_title": "Computer Science MS from Georgia Tech, Harvard and Oxford alum, AI Engineer at Cognino ",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/05e470acc817fae319af8a78cc10c82a5307f255.png",
      "domains": [
        "Education"
      ],
      "project_title": "Texas High School Dropout Rates",
      "project_desc": "Dropout rates in high schools throughout Texas have been steadily increasing, especially following the Covid-19 pandemic. Dropping out of high school has a permanent effect on the future of a person’s life, and as more students don’t make it to graduation, the more serious this issue becomes. The only way to combat this problem is by identifying what factors or characteristics of a campus are causing students to drop out. This project aims to solve this problem through an artificial intelligence algorithm that can predict the dropout rate of a Texas high school campus based on specific characteristics of the school. This project uses a gradient boosting model on a dataset by the TEA (Texas Education Agency) with information about high schools throughout the state. The results of this model are also implemented into an app where people can input information about a school and get a dropout rate prediction, as well as recommendation for that specific campus on how to decrease dropout rates. ",
      "research_paper": "assets/pdfs/87879ba876a94ace099efd8b0389d59c655d6fd5.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "github": "https://github.com/emily-joseph/Texas_Dropout_Rates/blob/main/app.py",
      "project_webpage": "https://emily-joseph-texas-dropout-rates-app-l52cuq.streamlit.app/",
      "graphic_link": "https://newjerseymonitor.com/wp-content/uploads/2021/12/GettyImages-168943719-700x467-1.jpg",
      "headline": "Dropout rates in high schools throughout Texas have been steadily increasing, especially following the Covid-19 pandemic. This project aims to solve this problem through an artificial intelligence algorithm that can predict the dropout rate of a Texas high school campus based on specific characteristics of the school.",
      "project_id": "4cc59fab0643e8de76419946644772a98630fb3b",
      "expand": false,
      "tags": [
        "Education",
        "COVID-19",
        "Dropout Rates"
      ],
      "related_proj": [
        33,
        73,
        34
      ]
    },
    {
      "student_name": "Julia S.",
      "mentor_name": "Barbie Duckworth",
      "mentor_title": "Computer Science BS Alumni MIT, prior Software Engineer at Facebook and eBay",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Environment"
      ],
      "project_title": "Predicting NH4 Levels for Corn Crop in Wisc",
      "project_desc": "Ammonium (NH4), an organic matter that accumulates in the top portion of soil, can pose a serious risk to biodiversity. Using machine learning to construct regression models, NH4 levels can be predicted and therefore mitigated. In this paper we used linear, ridge, and lasso regressions. Through the evaluation of  crop farming factors that contribute to the NH4 levels, it was concluded that NO3 and N2O have the most direct correlation to NH4. These factors yielded the best accuracy for regression models with the best performing model being a multiple feature linear regression which resulted in 60% accuracy. While certain measures did improve the model’s performance, outliers continuously worsened the results.  \n \n",
      "research_paper": "assets/pdfs/9e9f02aa29e4f86d442c4c6c4e0a0968f454020d.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://thumbs.dreamstime.com/b/corn-field-drone-perspective-aerial-view-cultivated-green-landscape-140491930.jpg",
      "headline": "Ammonium (NH4), an organic matter that accumulates in the top portion of soil, can pose a serious risk to biodiversity. Using machine learning to construct regression models, NH4 levels can be predicted and therefore mitigated. In this paper we used linear, ridge, and lasso regressions. Through the evaluation of  crop farming factors that contribute to the NH4 levels, it was concluded that NO3 and N2O have the most direct correlation to NH4. These factors yielded the best accuracy for regression models with the best performing model being a multiple feature linear regression which resulted in 60% accuracy. While certain measures did improve the model’s performance, outliers continuously worsened the results.",
      "project_id": "78937f8c624c506b3879d74078159e88a7a6d2af",
      "expand": false,
      "tags": [
        "Earth Systems",
        "Farming",
        "Chemicals"
      ],
      "related_proj": [
        7,
        68,
        26
      ]
    },
    {
      "student_name": "Samantha K.",
      "mentor_name": "Akshay Jagadeesh",
      "mentor_title": "Computational Neuroscience PhD from Stanford",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Psychology",
        "Healthcare and Biology"
      ],
      "project_title": "The Impacts of Child-Mentor Relationships on Child Mental Health",
      "project_desc": "With mental health being a field that is becoming progressively more familiar and researched in depth, an important subject of interest that should be addressed is child mental health, and the different factors that can influence it. In this paper, we use a dataset from the Substance Abuse and Mental Health Data Archive to analyze the impacts of child-mentor relationships on child mental health. Previous studies have come to similar conclusions: positive parent-student and teacher-student relationships often lead to signs of positive mental health in children. To expand upon these past findings, we used different measures of mental health and relationship qualities to create a predictive model. We conducted classification and coefficient weight analyses to see how strong of an impact different variables representing indicators of healthy relationships had on different aspects of child mental health. This information was used to create predictions of future cases. Like previous studies, we found that there was a general pattern that showed that good child-mentor relationships, defined specifically by the frequency of praise and fights, had an overall positive impact on child mental health, specifically when it came to symptoms of depression. Furthermore, parents seemed to have stronger impacts on child mental health than teachers did. Limitations include possibly biased respondents who may not be representative of the greater population, as well as the specificity of the variables that were chosen. Going forward, further steps to analyze different datasets and deepen the scope of the research will be helpful in finding patterns and developing more detailed conclusions.\n",
      "research_paper": "assets/pdfs/ae7c24c128051abc77e62973907114c6a2e90769.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://149942396.v2.pressablecdn.com/wp-content/uploads/2018/03/careers-student-teacher.jpg",
      "headline": "In this paper, we use a dataset from the Substance Abuse and Mental Health Data Archive to analyze the impacts of child-mentor relationships on child mental health. Previous studies have come to similar conclusions: positive parent-student and teacher-student relationships often lead to signs of positive mental health in children. To expand upon these past findings, we used different measures of mental health and relationship qualities to create a predictive model. We conducted classification and coefficient weight analyses to see how strong of an impact different variables representing indicators of healthy relationships had on different aspects of child mental health. This information was used to create predictions of future cases. Like previous studies, we found that there was a general pattern that showed that good child-mentor relationships, defined specifically by the frequency of praise and fights, had an overall positive impact on child mental health, specifically when it came to symptoms of depression. Furthermore, parents seemed to have stronger impacts on child mental health than teachers did. Limitations include possibly biased respondents who may not be representative of the greater population, as well as the specificity of the variables that were chosen. Going forward, further steps to analyze different datasets and deepen the scope of the research will be helpful in finding patterns and developing more detailed conclusions.",
      "project_id": "05db0922f47faa75083fbb1384b9915d90f119a7",
      "expand": false,
      "tags": [
        "Mental Health",
        "Education",
        "Psych"
      ],
      "related_proj": [
        73,
        41,
        47
      ]
    },
    {
      "student_name": "Ram N.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology",
        "Humanitarian Efforts and Social Justice"
      ],
      "project_title": "One Class Classification for Overdose Death Detection",
      "project_desc": "This paper describes a model intended to predict drug overdose deaths given a certain amount of information. This was done by analyzing and formatting data of drug overdose deaths in the US during 2012 to 2018. The data was then put into a One Class Classification model which would be able to predict the likelihood of a drug overdose death. Three different models were used returning an f1 score of 0.836, 0.849, and 0.85 respectively.  ",
      "research_paper": "assets/pdfs/82aa2b4124289b768db55bc41ff09bfb98e08656.pdf",
      "project_yr": "2022",
      "project_quarter": "Spring",
      "graphic_link": "https://people.com/thmb/mp3LBpiYOjPq1MgwHKJBgd_ri70=/1500x1000/filters:fill(auto,1)/drug-overdose-2-6599dce6b736463b825c1de98aefaec2.jpg",
      "headline": "In the past year alone there were an estimated 107,622 drug overdose deaths in just the United States. With such an incredible amount of deaths from just this, I thought it would be beneficial to create a model to predict who is at risk of drug overdose deaths.",
      "project_id": "d2fa188f0c1fc416dab710c7365bd445f6bd6018",
      "expand": false,
      "tags": [
        "Drug Overdose",
        "Drugs"
      ],
      "related_proj": [
        62,
        29,
        3
      ]
    },
    {
      "student_name": "Jason M.",
      "mentor_name": "Anna Orosz",
      "mentor_title": "Data Science MS from UPenn, Machine Learning Engineer at LinkedIn",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/c50317cf7c0da5ac8d79ea3b320a37860ef9fe88.png",
      "domains": [
        "Engineering"
      ],
      "project_title": "Allez Go: AI Fencing Referee",
      "project_desc": "The gradual increase in online fencing videos over the past decade has allowed for novel technical projects in fencing that rely heavily on data, such as artificial intelligence.  This study resulted in a state-of-the-art lightweight Temporal Convolutional Network to referee fencing bouts and classify actions as either a touch for the fencer on the left or the fencer on the right. To address this problem, we developed a pose estimation and audio analysis approach to autonomously referee fencing bouts. Using a custom dataset of international level fencing from the last 7 years, including ~4000 unique clips, our model achieved an accuracy of 89.1%, a 20% increase over previous state-of-the-art models. This model leverages advancements in human pose estimation to extract the position of both fencers and avoids high computational loads typically associated with CNNs. Additionally, it uses a novel technique to solve the issue of blade contact, a key component of refereeing fencing that was generally unaddressed in previous works. Our novel solution uses audio to ‘listen’ for the sound of blade contact rather than attempting to identify it visually. ",
      "research_paper": "assets/pdfs/06bec52004cebec38e16889039e8afd90442d3c9.pdf",
      "project_yr": "2022",
      "project_quarter": "Spring",
      "project_webpage": "https://bananapeel202-fencingwebapp-upload-xnj04o.streamlitapp.com/",
      "graphic_link": "https://images.theconversation.com/files/133347/original/image-20160808-18050-xlihp1.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1200&h=900.0&fit=crop",
      "headline": "Technology in fencing is generally an underdeveloped field and automated referees present potentially significant benefits to the sport. Automated referees will offer a more consistent call compared to a group of human referees with slightly different interpretations of the fencing rules.",
      "project_id": "77ececfe30468cb64dc87fadf0e983552743a873",
      "expand": false,
      "tags": [
        "Sports",
        "Fencing",
        "App Development"
      ],
      "related_proj": [
        13,
        4,
        9
      ]
    },
    {
      "student_name": "Anitej S.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/student_imgs/40cf8e4efe989b6d688c9ff498a88fa6db4a4ebe.png",
      "domains": [
        "Language and Literature"
      ],
      "project_title": " Is GPT-3 smarter than a sixth-grader?",
      "project_desc": "I work with the Davinci model in GPT-3, an autoregressive language model, to answer middle-school science textbook questions in the textbook question answering (TQA) dataset. The dataset was split into training, test, and validation sets. In this task, I simulate a student taking a test in three different scenarios. First, the Zero-Shot-Learning experiment where I only provide the model with the questions from a specific lesson. This would be the equivalent of a student going into a test without studying as the model has not gathered any knowledge from the lesson. Second, the Few-Shot-Learning experiment, where I provide the model with specific lesson content from the textbook and the corresponding questions. This equates to a student skimming over the lesson content before taking the test. Lastly, I fine-tuned the Davinci model on some of the textbook questions and then fed it questions. This is similar to a student doing a thorough review of the material before taking the test. After conducting all three experiments, I compare their accuracies and in doing so, highlight the “intelligence” and limitations of GPT-3. \n",
      "research_paper": "assets/pdfs/bb454b71ae4f6b392600ee1ea2ba28d5b74d4841.pdf",
      "github": "https://github.com/TejSuklikar/GPT-3-Research-Project",
      "graphic_link": "https://decemberlabs.com/wp-content/uploads/2021/02/768_2zpph46r1elg.jpg",
      "headline": "Question answering (QA) and Large Language models (LLM) have been a major research focus in Artificial Intelligence for several years. In 2017, a task called Textbook Question Answering (TQA) was introduced. The task included lessons from a middle school science textbook consisting of texts, diagrams, and natural questions. Many people attempted to create question answer models but reported sub-par accuracies.",
      "project_id": "12bafc1b0d40c5efca04d8d8aaef32d3ba22e042",
      "expand": false,
      "tags": [
        "GPT-3",
        "Natural Language Processing"
      ],
      "related_proj": [
        15,
        35,
        18
      ]
    },
    {
      "student_name": "Armon S.",
      "mentor_name": "Bryce Johnson",
      "mentor_title": "Computer Science Stanford Alum, Industry Data Analytics and Business Consultant at Oliver Wyman",
      "mentor_image": "assets/images/mentor_imgs/25cd6897de1225f0749b35c056fee4a35783e102.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Using Machine Learning Algorithms to Predict Property Prices",
      "project_desc": "While choosing a research topic, I wanted to explore a subject that related to troubles I had experienced in my daily life. After witnessing my parents struggle with purchasing a home in South Carolina, I decided to investigate the connection between AI and real estate, and how machine learning algorithms can be effective in determining property prices. I analyzed a dataset on AirBnb listings in New York City from 2016, which included characteristics such as location, availability, and interior/exterior features. After creating linear regression, decision tree, random forest, and neural network models, I calculated their respective MAEs to determine which was most effective in predicting prices. Then, I iterated through different values for their hyperparameters to study how I could increase their accuracies. After completing this step, I found that the neural network model was most effective in predicting real estate prices. ",
      "research_paper": "assets/pdfs/f40fd14c3686ac8ce70792afe0360b833f80b312.pdf",
      "project_yr": "2022",
      "graphic_link": "https://media.cntraveler.com/photos/63c1bf00a20dd5b7d9e22b1e/16:9/w_3200,h_1800,c_limit/airbnb.jpg",
      "headline": "I decided to investigate the connection between AI and real estate, and how machine learning algorithms can be effective in determining property prices, analyzing a dataset on AirBnb listings in New York City from 2016.",
      "project_id": "f7999e14b087ebf9f90ddb09708f272dd1041df9",
      "expand": false,
      "tags": [
        "Economics",
        "Prediction",
        "New York",
        "Real Estate"
      ],
      "related_proj": [
        60,
        53,
        78
      ]
    },
    {
      "student_name": "Nicholas K.",
      "mentor_name": "Shreyas Muralidharan",
      "mentor_title": "PhD Candidate in Electrical and Electronics Engineering at Stanford",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/0120d44e50765600fbd25118b22d75225d085edd.png",
      "domains": [
        "Environment"
      ],
      "project_title": "AI in Recycling",
      "project_desc": "The plastic pollution issue is an issue that has been plaguing the earth for the past half century and longer. Despite this, it has only been brought to light in the 21st century, and technology to help solve the issue is still new and largely undeveloped. Being someone who is passionate about environmental conservation, I wanted to create a tool that could be used to more easily sort recycling items. By using a machine learning algorithm, we have been able to create a tool that can detect what type of material an item is and determine whether it is recyclable or not. This tool can be applied to many different industry sectors, whether it is sorting items in a recycling plant, building it into an app for people to use day to day, or even aiding the plastic oceans cleanup effort. By creating this tool, we help do our part in protecting our planet and helping those who are less educated in the field to do so as well. We have approached the problem by using various machine learning algorithms to identify the material of items in a dataset. Using a KNN and CNN algorithm, we created a tool that became more and more accurate in identifying the material of an item. After testing the KNN and the CNN algorithm, we found that the CNN algorithm was much more accurate reaching a 68 % accuracy compared to 46% accuracy ",
      "research_paper": "assets/pdfs/fb2b02eb30f92383b188a126b2114e6d6d7fa527.pdf",
      "project_yr": "2022",
      "graphic_link": "https://img.vendingmarketwatch.com/files/base/cygnus/vmw/image/2022/03/16x9/SBX2022314_Recycling_Innovation_1536x1024.6231f4902dcf6.png?auto=format,compress&fit=fill&fill=blur&w=1200&h=630",
      "headline": "By using a machine learning algorithm, we have been able to create a tool that can detect what type of material an item is and determine whether it is recyclable or not.",
      "project_id": "d65aecd529c0729d9126735bb39fde11ccd3a9e4",
      "expand": false,
      "tags": [
        "Environmentalism",
        "Recycling",
        "Classification"
      ],
      "related_proj": [
        59,
        77,
        54
      ]
    },
    {
      "student_name": "David S.",
      "mentor_name": "Roger Jin",
      "mentor_title": "Computer Science MS at MIT, ML researcher at Apple",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Journalism",
        "Language and Literature"
      ],
      "project_title": "Fake News Detection with BERT",
      "project_desc": "Fake news has become a prevalent issue in today’s\nsociety, with the ability to spread rapidly and\ncause harm through misinformation. In this paper,\nwe propose a fake news detection model using a\nfine-tuned BERT (Bidirectional Encoder Repre-\nsentations from Transformers) model. BERT is a\npowerful language model that has been successful\nin a variety of natural language processing tasks.\nWe fine-tune the BERT model on a dataset of real\nand fake news articles from Kaggle, and evaluate\nits performance on a holdout test set. Our results\nachieve an accuracy of 0.574 on the fake news\ndetection task.",
      "research_paper": "assets/pdfs/b62726ea9e02a33a78c7a323156a6fc90ba316e4.pdf",
      "project_yr": "2022",
      "graphic_link": "https://about.fb.com/wp-content/uploads/2020/06/117592988_613376329317475_1014520698677157145_n.jpg?resize=890%2C501",
      "headline": "In this paper, we propose a fake news detection model using a fine-tuned BERT (Bidirectional Encoder Representations from Transformers) model.",
      "project_id": "6f3fc38d7da0d7ab52b86f567f619edd9d3239a7",
      "expand": false,
      "tags": [
        "News",
        "Fake News",
        "BERT"
      ],
      "related_proj": [
        7,
        60,
        24
      ]
    },
    {
      "student_name": "Rohan T.",
      "mentor_name": "Nic Thibodeaux",
      "mentor_title": "Mentor consent not given",
      "mentor_image": "assets/images/mentor_imgs/a8741ef839f967cc56ad99d15d117998827e1d41.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Brain Cancer Detection",
      "project_desc": "Through the rapid destruction of brain cells, malignant brain tumors can be one of the most dangerous forms of cancer that exist. Current methods for determining the presence and type of brain tumor in a given patient’s MRI scan can oftentimes be inefficient and are prone for error. By using a machine learning algorithm, the error in these classifications is reduced significantly, and the process is made much more efficient. To approach this problem, we have implemented an Inception Resnet, which is a pretrained Convolutional Neural Network. The final model is able to determine the presence of a possible brain tumor as well as distinguish the type between three different classes. These classes include pituitary, meningioma, and glioma. Pituitary tumors are the most harmless of the three as they are noncancerous. The five year survival rate for a patient with a pituitary tumor is 97%. This contrasts greatly with both glioma and high grade meningioma tumors which are life-threatening [2]. It should be noted, however, that high grade meningioma tumors are very rare. Along with these three classes, a separate control class with no brain tumors was also used. After training the model on these four classes, the results were found to be impressive, as the final accuracy was at 96.7%. ",
      "research_paper": "assets/pdfs/1af78eeff767deaeb67b548a0580dff075490f4e.pdf",
      "project_yr": "2022",
      "graphic_link": "https://medicine.wustl.edu/wp-content/uploads/GlioblastomaBranScans.jpg",
      "headline": "Current methods for determining the presence and type of brain tumor in a given patient’s MRI scan can oftentimes be inefficient and are prone for error. By using a machine learning algorithm, the error in these classifications is reduced significantly, and the process is made much more efficient.",
      "project_id": "27117f99bd699eb87adf3d43adad7cbccafacd69",
      "expand": false,
      "tags": [
        "Brain Cancer",
        "CNNs",
        "Cancer"
      ],
      "related_proj": [
        63,
        29,
        75
      ]
    },
    {
      "student_name": "Aishwaroopa N.",
      "mentor_name": "Tomer Arnon",
      "mentor_title": "MS Engineering at Stanford",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/b5881f4a60a9f4705e87bf2db4a587c136e230fa.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Using EEG to Detect Eye Movement",
      "project_desc": "In this paper, we show that it is possible to use EEG data to detect eye movement using machine learning. By recognizing eye movement through EEG results, our goal is to help individuals with disabilities better control object movement and perform daily activities independently. This is especially important as many disabled individuals rely on assistance from others for their daily needs, which can be burdensome for the person providing help. To achieve these objectives, we trained different machine learning models using a data set of eye-state classification from Kaggle. We analyzed the results to assess the accuracy of a KNN (K Nearest Neighbors) model. With the model achieving an accuracy of 95.23% in detecting eye movement in patients. These findings suggest that the model could be effectively utilized in the future, with further research to assist individuals with disabilities. Overall, our research suggests that it is possible to recognize eye movement through EEG results reliably. Further research in this area could lead to the development of more effective and personalized interventions for individuals with poor hand-eye coordination.",
      "research_paper": "assets/pdfs/d2d365ee73270aa118e835366612c9d3087861e3.pdf",
      "project_yr": "2022",
      "graphic_link": "https://www.rochester.edu/newscenter/wp-content/uploads/2023/02/fea-fixational-eye-movements.jpg",
      "headline": "In this paper, we show that it is possible to use EEG data to detect eye movement using machine learning. By recognizing eye movement through EEG results, our goal is to help individuals with disabilities better control object movement and perform daily activities independently.",
      "project_id": "93f69f6e27f7f28be4488f702851296b8fccb230",
      "expand": false,
      "tags": [
        "Physiology",
        "Eyes"
      ],
      "related_proj": [
        22,
        28,
        71
      ]
    },
    {
      "student_name": "Joseph N.",
      "mentor_name": "Oscar O'Rahilly",
      "mentor_title": "Mentor consent not given",
      "mentor_image": "assets/images/mentor_imgs/a8741ef839f967cc56ad99d15d117998827e1d41.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Arts and Music"
      ],
      "project_title": "Sketch Recognition using Artificial Intelligence",
      "project_desc": "This paper is about an AI project that helps people learn about animals. The AI can recognize hand-drawn sketches of animals and other objects and provide information about them. I was motivated to start this project because of my interest in art and wanted to build an AI system that could learn to detect art created by humans. I used different supervised classification algorithms such as Logistic Regression, Random Forest and Ridge Classifier to train our model. Random Forest classifier performed the best among all the models we used with an accuracy of 72.8%. I used Python and used Google’s Quickdraw to collect images and data.",
      "research_paper": "assets/pdfs/86415b2f98bfcd8cf6ce65bdc2a7c5e0e6fc82f4.pdf",
      "github": "https://drive.google.com/drive/folders/1lBCXrXiEam_gs7-SeL25IwB6Xa6_8qc5",
      "graphic_link": "https://cdn.psychologytoday.com/sites/default/files/styles/article-inline-half-caption/public/field_blog_entry_images/2018-09/sketch_2.jpg?itok=0ZpcuMDD",
      "headline": "This paper is about an AI project that helps people learn about animals.",
      "project_id": "1a5ced28013c5a496d372a1278286642217a817d",
      "expand": false,
      "tags": [
        "Visual Arts",
        "Google",
        "Classification"
      ],
      "related_proj": [
        11,
        4,
        38
      ]
    },
    {
      "student_name": "Roneet D.",
      "mentor_name": "Tony Rodriguez",
      "mentor_title": "PhD Candidate in Astrophysics at Caltech",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Physics"
      ],
      "project_title": "Findings Provided by a Machine Learning Clustering Model of Stellar Kinematics in Star Clusters Can be Used to Identify Runaway Stars",
      "project_desc": "Star clusters dissipate as internal and external gravitational interactions weaken its tidal radius, causing smaller groups of stars to split apart in several directions while pushing other stars along with it. The need for developing a machine learning model that can detect these runaway stars is established in this research as it attempts to expand the domain of astrophysics to help astrophysicists understand tidal tail formation and the theoretical dark matter subhalos’ effects on celestial bodies. Data from the ESA’s Gaia DR 3 was utilized and noise was removed through data cleaning with 4 parameters: RAdeg, DEdeg, PM, and Distance that were then factored into a K-means clustering algorithm, which created the star clusters. These 4 factors were subsequently compared and analyzed in various scatterplots. The findings revealed the model’s success in identifying potential candidates of runaway stars by confirming the existence of high proper-motion stars amongst other more similar proper-motion stars and the ability for stars to be separate by vast distances across their cluster, indicating possible tidal tails. Future improvements to work around various limitations encountered throughout this research focus on the development of a hybrid clustering-nueral network model to automatically detect and predict the likelihood of runaway stars from their clusters. ",
      "research_paper": "assets/pdfs/68cece4d99993ebd66be937d4dcfd7348ff521a5.pdf",
      "graphic_link": "https://cdn.mos.cms.futurecdn.net/DyjQV2xGR43rrbfVcn8wqU-320-80.jpg",
      "headline": "The need for developing a machine learning model that can detect these runaway stars is established in this research as it attempts to expand the domain of astrophysics to help astrophysicists understand tidal tail formation and the theoretical dark matter subhalos’ effects on celestial bodies.",
      "project_id": "f78d53783940a77db8cf626d3031cc95f5ad469b",
      "expand": true,
      "tags": [
        "Astronomy",
        "Stellar Classification",
        "Kinematics"
      ],
      "related_proj": [
        61,
        36,
        52
      ]
    },
    {
      "student_name": "Vadim Y.",
      "mentor_name": "Darnell Granberry",
      "mentor_title": "MEng Computer Science from MIT, current Machine Learning Engineer",
      "mentor_image": "assets/images/mentor_imgs/c6b9992da6de5416f20e244e0d5f28548c16b7fa.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Environment"
      ],
      "project_title": "Predicting Precipitation and Other Weather Conditions With Logistic Regression and Random Forest Classifiers",
      "project_desc": "Nowadays, we predict the weather to get a better understanding of the days to come. An issue we have with our current algorithms is the inability to predict weather accurately for any time range further than ten days. Our intentions with this project were to create a model that could get an accuracy within 5% of our current weather prediction algorithms. We wanted the model to be accurate in both short-term and long-term conditions. Our current algorithms, while highly accurate in the short term, struggle in the long-term timespan. The importance of accuracy in this model can be boiled down to two main points; convenience, for planning activities, and safety, as perhaps an early warning system in the event of a possibly harmful or fatal weather event. Our method of achieving these goals was to  first use a logistic regression model, and later a random forest classifier. In the end we reached a highest accuracy of 83%, which fell just short of our goal of 85%. Despite the inaccuracy, our model showed promising results, and if we had more time or a larger dataset, the accuracy could have been higher. In the end, the results seemed more to be a proof of concept, rather than a demonstration of accuracy and capability. ",
      "research_paper": "assets/pdfs/fc0090c1f939855ee18545e60d1f986db0fb6948.pdf",
      "graphic_link": "https://s.w-x.co/West_Plains_1107a.jpeg?crop=16:9&width=320&format=pjpg&auto=webp&quality=60",
      "headline": "An issue we have with our current algorithms is the inability to predict weather accurately for any time range further than ten days. Our intentions with this project were to create a model that could get an accuracy within 5% of our current weather prediction algorithms.",
      "project_id": "32d254828e54221df930fa94f6c3b043b0ba2f34",
      "expand": true,
      "tags": [
        "Weather",
        "Earth Systems"
      ],
      "related_proj": [
        20,
        54,
        49
      ]
    },
    {
      "student_name": "Rohan S.",
      "mentor_name": "Christina Cheng",
      "mentor_title": "Materials Science and Engineering PhD Candidate at Stanford, ",
      "mentor_image": "assets/images/mentor_imgs/501d6c73dda97ab7889115b397cfcd39dba10a63.png",
      "student_image": "assets/images/student_imgs/afe213a0c2e93d17cff0db9c2a585dc0433f969e.png",
      "domains": [
        "Education"
      ],
      "project_title": "Standardized Testing is it Really Effective?",
      "project_desc": "How effective is standardized testing in assessing students' knowledge? With how much standardized testing has been reinforced in our education, students should be properly assessed for their knowledge, and not be given tests that interfere with their academic learning. Under the federal, Every Student Succeeds act, schools must provide standardized tests. However, some of these standardized tests might not be doing what their intended purpose is and instead interfering with academic learning. had data from previous students on sat scores and GPAs from college and high school. I can use this data and plug it into different models to determine how well these sat scores determine GPA. I used different models to help determine and plot the results. To evaluate and determine how accurate these results are, I used three different error-calculating methods. When using linear regression to evaluate sat scores and first-year college GPA, there was a 0.532 mean percent error. This error seemed high for these two variables. There isn’t a strong enough correlation between sat scores and college GPA for it to be implemented in schools across the nation.",
      "research_paper": "assets/pdfs/99ea6674663522b4cb0bb9fbb4cfa1763ea8196d.pdf",
      "graphic_link": "https://www.ontocollege.com/wp-content/uploads/2019/02/AdobeStock_90430158_cup.jpg",
      "headline": "How effective is standardized testing in assessing students' knowledge? With data from previous students on sat scores and GPAs from college and high school, I can use this data and plug it into different models to determine how well these sat scores determine GPA.",
      "project_id": "aac3c77f5f93d758213854796a0c04ba7bd27ae0",
      "expand": false,
      "tags": [
        "Education",
        "Standardized Testing"
      ],
      "related_proj": [
        3,
        73,
        34
      ]
    },
    {
      "student_name": "Yuna S.",
      "mentor_name": "Shreya Parchure",
      "mentor_title": "MD-PhD student at UPenn",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Education"
      ],
      "project_title": "A new style of teaching: Exploring the benefits of visual language learning",
      "project_desc": "This project was designed to investigate the efficiency and likelihood of people learning a new language through means of an AI that would help translate objects in day to day life to a language that the user would want to learn. This specific project would help to benefit a better understanding of languages and enable the user to have better connection and communication skills with others. The overall approach taken to achieve this goal came in the form of two parts: object detection and natural language processing (NLP). The first part contained training the AI on certain categories of objects which would then be put through the second part of the AI, the translation. The user would also be able to interact with the AI by inputting their own data and selecting a certain language they would like to learn. The AI was seen to have around a 35% accuracy rate in determining the correct image but had a few errors when encountering the translation side of things. Regardless, some important conclusions were that the AI was successful in being able to translate languages and would certainly help people in their language learning endeavors. ",
      "research_paper": "assets/pdfs/caba5a6db17f372e1f4acf82fe5daa4978c509e0.pdf",
      "graphic_link": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2022/11/Google-Translate-on-an-Android-phone.jpg",
      "headline": "This project was designed to investigate the efficiency and likelihood of people learning a new language through means of an AI that would help translate objects in day to day life to a language that the user would want to learn.",
      "project_id": "45f834c7383730d93c58656b5897988425ec17da",
      "expand": false,
      "tags": [
        "Modern Languages",
        "Natural Language Processing",
        "Education"
      ],
      "related_proj": [
        9,
        3,
        19
      ]
    },
    {
      "student_name": "Peijie G.",
      "mentor_name": "Kush Khosla",
      "mentor_title": "MS Computer Science from Stanford, Lead Data Scientist at Retain.ai",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Language and Literature"
      ],
      "project_title": "Predicting Future Phonological Changes Of Mandarin Chinese ",
      "project_desc": "Linguists made historical reconstructions extensively based on existing patterns and common trends of phonological changes without the aid of sound data, yet previously little was done to extend such patterns into the future as a result of mostly human work in the field of historical linguistics. We created a system of translating IPA representation to vectors that captures characteristics of phonemes such as their articulatory location, and experimented with several machine learning models to capture existing trends from Old, Middle to Modern Chinese (Mandarin). Then we attempted to predict future Mandarin pronunciations based on existing phonological data and ancient reconstructions. The models were successful at capturing trends of Ancient to Modern Chinese shifts, as a great majority of the validation results were exactly correct. The predictions from the models vary in consistency of outputs and phonological inventory, but they are largely logical and may offer insight into future shifts. Therefore it is possible to predict phonological changes with machine learning, yet the accuracy of the predictions still needs validation in the future. If the predictions are proven to be effective in the future, the solutions may provide a method of capturing phonological changes and validating previous ancient reconstructions. ",
      "research_paper": "assets/pdfs/91ca19e3cc5325d7c9ee52573093be4174269b43.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://sguru.org/wp-content/uploads/2019/11/mandarin.jpg",
      "headline": "We created a system of translating IPA representation to vectors that captures characteristics of phonemes such as their articulatory location, and experimented with several machine learning models to capture existing trends from Old, Middle to Modern Chinese (Mandarin). ",
      "project_id": "01032d50e1636761d051f258a4ed525c6834fac1",
      "expand": false,
      "tags": [
        "Natural Language Processing",
        "Modern Languages"
      ],
      "related_proj": [
        24,
        42,
        15
      ]
    },
    {
      "student_name": "Eve B.",
      "mentor_name": "Tomer Arnon",
      "mentor_title": "MS Engineering at Stanford",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/b219f65a882647f48faf2fe426e41d395d5bf2a5.png",
      "domains": [
        "Physics"
      ],
      "project_title": "Using Machine Learning to identify the Habitability of Exoplanets from TESS Transit Data",
      "project_desc": "With so many new tools and methods to detect exoplanets, it is time to start determining which are deserving of more research in the hunt for other habitable planets. We began our research with exoplanets that are similar to Earth as the most likely to house life. We used transit measurements such as an exoplanet's size, temperature, and relative distance from its star as well as machine learning to develop two models: one to predict if an object of interest was an exoplanet and another to cluster our data to determine its similarity to Earth. We achieved an 88.7% accuracy for the first model, and our clustering algorithm found interesting results when compared to a graph showing the principal components of the data. We found that our Earth data point fell right on the origin of our 2 dimensional PCA graph and was placed in our largest cluster. Both of our models showed that machine learning can be useful in the search for habitable exoplanets and is deserving of more research.",
      "research_paper": "assets/pdfs/8f548c4b9bf6ae3e084359150b1c38b47eca2e28.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://scitechdaily.com/images/How-Scientists-Search-for-Habitable-Planets.jpg",
      "headline": "With so many new tools and methods to detect exoplanets, it is time to start determining which are deserving of more research in the hunt for other habitable planets.",
      "project_id": "f8e34d726f8105d43be6e3ca5c92e7ff69d4dc6c",
      "expand": true,
      "tags": [
        "Astronomy",
        "Physics"
      ],
      "related_proj": [
        56,
        6,
        65
      ]
    },
    {
      "student_name": "Deetya N.",
      "mentor_name": "Linda Banh",
      "mentor_title": "Electrical Engineering MS from Stanford with professional AI Certificate, Engineer at Microsoft",
      "mentor_image": "assets/images/mentor_imgs/92382be5a945bc034f0c2aaa5f9d801172bc9e3e.png",
      "student_image": "assets/images/student_imgs/e941d68148c11a17a0d59a2814300cb47acae3b1.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Predicting Drug-Drug Interaction Severity Using Network Characteristics",
      "project_desc": "Drug-drug interactions (DDIs), which can add to or diminish the effect of one drug or impact the metabolism of one drug, have harmful effects on health in patients that take multiple drugs. Testing for DDIs is slow and costly, so computational models have recently been used to predict them. Network information is useful in describing a drug’s known interactions and mechanisms to determine whether two drugs could be interacting. This research explores various machine learning models to predict the severity of unknown interactions of existing drugs (major, minor, or moderate), using the DDInter database. The best-performing model, a multi-layer perceptron model which concatenates two drugs’ embeddings, had an accuracy of about 92%, average precision of about 87.1% (89.4% for the major category, 78.5% for minor, and 93.5% for moderate) and average recall of 83.3% (86.4% for major, 70.1% for minor, and 95.3% for moderate). Future work in this area includes refining models to increase precision and recall, obtaining a more balanced dataset, predicting the mode of interaction, and using other drug characteristics. The code for this project can be found here, along with a Streamlit deployment of the model: https://github.com/deetyabn/DDI_severity_prediction. ",
      "research_paper": "assets/pdfs/4b20dff436fd43b9c03333720613b533d6843582.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "github": "https://github.com/deetyabn/DDI_severity_prediction",
      "project_webpage": "https://colab.research.google.com/drive/1ODK9UsFpHrRFA54kDgmITYIGa9YSD0sd?usp=sharing",
      "graphic_link": "https://www.grxstatic.com/4f3rgqwzdznj/4YlSpmw5yn50QkFRPQV5wL/af16db25565cbbbb551e7cbb43a0adb1/spilling_pills_various_pink_background-1174440156.jpg?format=pjpg&auto=webp&width=704",
      "headline": "Drug-drug interactions (DDIs), which can add to or diminish the effect of one drug or impact the metabolism of one drug, have harmful effects on health in patients that take multiple drugs. Testing for DDIs is slow and costly, so computational models have recently been used to predict them. Network information is useful in describing a drug’s known interactions and mechanisms to determine whether two drugs could be interacting. This research explores various machine learning models to predict the severity of unknown interactions of existing drugs (major, minor, or moderate), using the DDInter database.",
      "project_id": "bfe1af68283bedebfde2328478d0a265c3429119",
      "expand": false,
      "tags": [
        "Drugs",
        "Biology",
        "Web Deployment"
      ],
      "related_proj": [
        43,
        67,
        21
      ]
    },
    {
      "student_name": "Saket R.",
      "mentor_name": "Bradley Yam",
      "mentor_title": "Computer Science BS from Yale, Software Engineer",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Humanitarian Efforts and Social Justice"
      ],
      "project_title": "What Factors Correlate with the Relationship Between Gender and Race and Pursuing STEM?",
      "project_desc": "The world of technology and Science, Technology, Engineering, and Math (STEM) is dominated by Caucasians, Asians, and males. According to Computer Science.org, while African Americans and Latinos make up 13.4% and 16% of the US population respectively, they only comprise 9% and 7% of STEM occupations (McGee). In this paper, I sought to answer the question, “How do races and genders differ in the way they pursue STEM, and what factors correlate with these differences?” Identifying which factors cause this lack of representation is the most important step in fixing the diversity problem. \n\nTo answer this question, I used data from the High School Longitudinal Study (HSLS), which asked hundreds of questions at different points throughout students’ high school and college careers. I used 16 of these questions and analyzed how strongly they correlate with pursuing a STEM career or not pursuing a STEM career. I found that Asians are much more likely to pursue STEM, African Americans are much less likely to pursue STEM, and women are much more likely to pursue STEM, although they largely pursued health occupations within STEM.\n\nIt is important that we make sure everyone feels comfortable pursuing or not pursuing STEM. From my literature review, I found that Asians are more likely to and African Americans are less likely to pursue STEM because Asians feel like they fit in and African Americans feel like they don’t (Milgrom-Elcott). In order to increase the diversity in the STEM workforce, we need to make sure all minority groups feel welcomed in high school STEM classes, college STEM courses, and STEM workplaces themselves.\n",
      "research_paper": "assets/pdfs/5b2b8e16f39c1db60406f1020de89a4abb9cf94d.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.familyeducation.com/sites/default/files/2023-02/Black%20Female%20Scientists%20That%20Have%20Shaped%20US%20History_Feature.jpg",
      "headline": "In this paper, I sought to answer the question, “How do races and genders differ in the way they pursue STEM, and what factors correlate with these differences?” Identifying which factors cause this lack of representation is the most important step in fixing the diversity problem. ",
      "project_id": "6a81620dda02871bb7ce4f1b2c806a64ac08f1be",
      "expand": true,
      "tags": [
        "Gender Equality",
        "Racial Equality",
        "Education",
        "Social Justice"
      ],
      "related_proj": [
        49,
        22,
        79
      ]
    },
    {
      "student_name": "Archith S.",
      "mentor_name": "Barbie Duckworth",
      "mentor_title": "Computer Science BS Alumni MIT, prior Software Engineer at Facebook and eBay",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/a06c48b74921fc598ba3cd0785ba3f16762ce2e7.png",
      "domains": [
        "Environment",
        "Healthcare and Biology"
      ],
      "project_title": "Insect Identification Project for Agricultural Advancement",
      "project_desc": "Insects are complex creatures whose influence and characteristics can drive ecosystems or destroy plant populations. Therefore, it is imperative to recognize the differences between them and whether they pose harm or benefits, yet the majority of humans do not have a keen view for the differences in insect qualities. Through the use of image data, we developed an artificial intelligence system which is able to predict an insect’s species based on a photo of a given insect. To assess the image data, we developed a convolutional neural network (CNN) which uses a series of neurons to output a result which we can interpret to identify the given insect. The highest validation accuracy we received was approximately 80%, which given the very subtle differences between the insects we used, the amount of categories we were defining from, and the limited number of images in each category, was a decently high validation accuracy. From this, we could conclude that we can not only identify a species, but with relatively high accuracy, giving us insight into how insect identification is a valid and applicable process which can be implemented into agricultural and pest control technology. ",
      "research_paper": "assets/pdfs/b1f9b06b9b68ef844fbc4a55a3f282e47ef9af0a.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "github": "https://github.com/archith-s/Insect-Identification",
      "graphic_link": "https://www.innovationnewsnetwork.com/wp-content/uploads/2022/02/beekeeping.jpg",
      "headline": "Through the use of image data, we developed an artificial intelligence system which is able to predict an insect’s species based on a photo of a given insect. ",
      "project_id": "e74fd4dd5f1bdd0250ad1c870497b02257280bb2",
      "expand": false,
      "tags": [
        "Wildlife",
        "Farming"
      ],
      "related_proj": [
        1,
        49,
        55
      ]
    },
    {
      "student_name": "Maximilian P.",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Environment"
      ],
      "project_title": "Predicting Solar Array Output Using Weather Sensor Data",
      "project_desc": "With the recent push for renewable energy sources, solar energy is one that is readily available. This paper will explore how to predict the power output of a solar array based on weather data, collected from sensors throughout each day.. With the predicted output of a solar array, a grid operator could decide which other sources of energy would be needed to run to meet energy demand. A linear regression machine learning model will be used to create a correlation between weather data such as irradiation and power output. The best model, the Gradient Boosting Regressor, produced a mean average error of just under 300w.",
      "research_paper": "assets/pdfs/6008428e114c5261e67c9729cab14272a1574e37.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.sunrun.com/sites/default/files/styles/gsc_feature_750x300/public/best-solar-panels-home-budget-feature-opt.jpg?itok=GR6g7v48",
      "headline": "With the recent push for renewable energy sources, solar energy is one that is readily available. This paper will explore how to predict the power output of a solar array based on weather data, collected from sensors throughout each day.",
      "project_id": "028983fdbb7bceb940cab8c91909f93a229c83af",
      "expand": false,
      "tags": [
        "Solar Cycles",
        "Solar Power",
        "Solar Flares",
        "Earth Systems"
      ],
      "related_proj": [
        59,
        77,
        7
      ]
    },
    {
      "student_name": "Eera B.",
      "mentor_name": "Clayton Greenberg",
      "mentor_title": "Teaching Professor from UPenn",
      "mentor_image": "assets/images/mentor_imgs/386ead2265f41608f1d70e611d406f8eb3916841.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology",
        "Environment"
      ],
      "project_title": "Plant Toxicity Classification by Image",
      "project_desc": "Poisonous and non-poisonous plants have extremely similar visible features to any non-botanist,\nwhich puts those in danger who are frequently present in areas containing various plants. Failure\nto distinguish harmful plants from safe ones puts several people at a high risk of accidents and\npotential health issues after contact with a toxic plant. While previous work has found ways to\nclassify specific types of plants, a limited amount of research has been done with toxic and\nnon-toxic plants of several species. Since differentiating between dangerous and safe plants is a\ncomplex task for a human brain, this study approaches the issue through machine learning\nmodels starting with a convolutional neural network (CNN) and discovering that a logistic\nregression model—trained on a dataset with manually designed features—has the best\nperformance with the particular dataset used. The neural network demonstrated overfitting which\nwas likely caused by the inconsistent backgrounds of images within the dataset. The logistic\nregression model achieved an accuracy of 97.37% in its predicted classifications for the plants.\nThe best-performing logistic regression model contained the three-leaf and dark red stem\nfeatures indicating that these two features are the most reliable ones used to distinguish between\ntoxic and non-toxic plants.",
      "research_paper": "assets/pdfs/0c1290eefaf9ec7f2aef9d2635e0936e206d83dc.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://post.healthline.com/wp-content/uploads/2022/10/angel-trumpet-plant-flowers-1200-628-facebook-1200x628.jpg",
      "headline": "Since differentiating between dangerous and safe plants is a complex task for a human brain, this study approaches the issue through machine learning models starting with a convolutional neural network (CNN) and discovering that a logistic regression model—trained on a dataset with manually designed features—has the best performance with the particular dataset used. ",
      "project_id": "71e4256690404e931a1ba7dbc8524aa7f15eb54b",
      "expand": false,
      "tags": [
        "Earth Systems",
        "Plants",
        "Classification"
      ],
      "related_proj": [
        28,
        26,
        62
      ]
    },
    {
      "student_name": "Roshni K.",
      "mentor_name": "Philip Bell",
      "mentor_title": "Computer Science MS from Georgia Tech, Harvard and Oxford alum, AI Engineer at Cognino ",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Journalism",
        "Language and Literature"
      ],
      "project_title": "Fake News Classification",
      "project_desc": "As fake news becomes more of a problem across the US, its consequences are becoming more and more damaging. Many viewers who interact with information online are unable to distinguish the difference between fake information and real information, especially with social media worsening the spread of fake articles. This project aims to combat this disinformation through an artificial intelligence algorithm that can classify real articles versus fake ones. The model utilizes a BERT model and is tested on two different datasets, the Kaggle dataset and the LIAR dataset. The results are also presented through an app where readers can input any article and immediately find out whether it contains false information or not.",
      "research_paper": "assets/pdfs/3979a93a7065e34965988a5f02311bf3708b6051.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://media.newyorker.com/photos/59097c441c7a8e33fb390384/master/w_4954,h_2560,c_limit/FakeNews_Lemann_WP.jpg",
      "headline": "As fake news becomes more of a problem across the US, its consequences are becoming more and more damaging. This project aims to combat this disinformation through an artificial intelligence algorithm that can classify real articles versus fake ones.",
      "project_id": "85fb41c71beb68825639358f04f6b3dce97a4b31",
      "expand": false,
      "tags": [
        "News",
        "Fake News",
        "Natural Language Processing",
        "LSTMs"
      ],
      "related_proj": [
        48,
        7,
        60
      ]
    },
    {
      "student_name": "Noor E.",
      "mentor_name": "Yiran Li",
      "mentor_title": "Biometry and Stats Cornell Alum, Bioinformatics MS at ETH Zürich",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/0f009ab2bd49d49e2d7b897b4b144e02b3034eaa.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Application of Machine Learning to Distinguish Premature Leukemia Cells from Healthy Blood Cells",
      "project_desc": "Leukemia is a disease that primarily impacts children. The likelihood of beating this deadly disease increases with early detection. Because premature Leukemia blasts are unidentifiable by the human eye, different methods are needed to accurately diagnose cancer in its early stages. Convolutional Neural Networks (CNNS) to solve this problem have been created with classification validation accuracy rates as high as 96.15%. A dataset from the Cancer Imaging Archive [1] was used to train a CNN model. Of the 15,135 images in the dataset, 600 were used to prevent system crashing. With the limited resources available, a 63.6% validation accuracy was achieved. ",
      "research_paper": "assets/pdfs/abf74209725c307c0eb1d3fc2b5744f759e11777.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://cdn2.poz.com/40679_iStock-117868474.jpg_4145d49a-c89c-40eb-a574-290f096de470_x2.jpeg",
      "headline": "Convolutional Neural Networks (CNNS) to solve this problem have been created with classification validation accuracy rates as high as 96.15%. ",
      "project_id": "7a409f003cf56c704a89210b564fa7ef5ddec77e",
      "expand": true,
      "tags": [
        "Leukemia",
        "Diseases and Health Conditions"
      ],
      "related_proj": [
        75,
        74,
        44
      ]
    },
    {
      "student_name": "Nuo W.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Attention LSTMs in Multimodal Models: A holistic approach to predicting COVID infection trends",
      "project_desc": "COVID-19 and its infection trends are a hot topic in the AI space due to the seeming applicability of AI, which could help with case preventions and medical resource allocations. However, too often people focus on a predetermined area and scale, overlooking the fact that COVID doesn’t flow into or out of just one area but instead spreads everywhere simultaneously. Thus, we propose novel approaches to process the infection rates of all states in the United States as a whole while taking into account the interconnectivity between states through domestic flights. We introduce 1) the graph attention LSTM for analyzing domestic flights across states, 2) the image attention LSTM for understanding infection rates from United States COVID heat maps, and 3) the attention bottleneck mid fusion model that integrates graph and image attention LSTMs. Through tests that require simultaneous predictions of the infection rates in all US states, we compare the performances of our methods with those of classic sequence-processing methods and achieve significantly more accurate results.",
      "research_paper": "assets/pdfs/60c004c21f0b82bf2ddb65dbb9325928468fd194.pdf",
      "project_yr": "2022",
      "project_quarter": "Spring",
      "github": "https://github.com/NuoWenLei/Attention-LSTMs-in-Multimodal-Models",
      "project_webpage": "https://nuowenlei-attention-lstms-in-multimoda-model-comparison-hoq2rx.streamlitapp.com/",
      "graphic_link": "https://www.news-medical.net/images/news/ImageForNews_722926_16611632963032177.jpg",
      "headline": "In our search for a way to simultaneously predict all state-level COVID infection rates in the United States with COVID heat maps and domestic flight graphs, we propose novel methods of processing graph and image sequences with attention-based LSTM layers as well as evaluate the effectiveness of different multimodal fusion techniques.",
      "project_id": "c030fe0fd0857c2c8640e4879ee074ef767e49f6",
      "expand": true,
      "tags": [
        "LSTMs",
        "COVID-19",
        "Diseases and Health Conditions"
      ],
      "related_proj": [
        51,
        41,
        1
      ]
    },
    {
      "student_name": "Claire M.",
      "mentor_name": "Clayton Greenberg",
      "mentor_title": "Teaching Professor from UPenn",
      "mentor_image": "assets/images/mentor_imgs/386ead2265f41608f1d70e611d406f8eb3916841.png",
      "student_image": "assets/images/student_imgs/7849bf08c4b2c881e69acf87d831314b7e0d585e.png",
      "domains": [
        "Psychology"
      ],
      "project_title": "Predicting emotion ratings from  color statistics of images",
      "project_desc": "Which features in art affect emotional reactions? In order to answer this question, we took a variety of abstract images and included people’s emotional ratings for each image, for eight different emotions. We utilized this data to see how visual elements affect our everyday lives by engineering features of images and running that through a variety of neural networks. Out of all the networks we ran our data through, the linear regression model performed the best with a mean average error of around 1.4. All the other neural networks, including a convolutional neural network, had a mean average error of at least 1.7. The full-size linear regression model with all engineered features worked best in predicting the emotional values associated with each image. That is, all specific features were significant and we did not find meaningful differences among the models for different emotion ratings.",
      "research_paper": "assets/pdfs/84051a62e1d5babdd5177b3383fbb7dbd5712c8f.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.searchenginejournal.com/wp-content/uploads/2019/07/google-to-capture-and-learn-about-our-emotions-on-a-smartphone-camera.png",
      "headline": "We utilized this data to see how visual elements affect our everyday lives by engineering features of images and running that through a variety of neural networks.",
      "project_id": "a9e8f0362783db914e4fc941e2d7e176e13f0e8a",
      "expand": false,
      "tags": [
        "Psych",
        "Facial Emotion"
      ],
      "related_proj": [
        62,
        21,
        79
      ]
    },
    {
      "student_name": "Thalia S.",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "PoliSci and Law"
      ],
      "project_title": "Is AI Necessary In Deciding Whether an Offender Is Likely To Recidivate, With & Without the Effect of Protected Characteristics",
      "project_desc": "Our research topic addresses the issue of whether or not an AI algorithm can be developed  to forecast whether or not a criminal would recidivate by removing protected characteristics from models in terms of both accuracy, precision and recall and their equality across different groups, as well as if such a tool is necessary. The background of this issue is that there is always an underlying human prejudice present in the criminal justice system when it comes to making judgments, thus it is crucial to determine whether or not this human bias is required while making these decisions and whether there is similar kind of bias with machine learning methods. There are various ways to approach and respond to this topic, but the strategy we used involved examining the key variables that might influence prejudice, such as gender or ethnicity, and comparing how well the AI system can predict whether someone is likely to recidivate with or without incorporating these protected characteristics. The research's significant findings are that, after utilizing a number of different models, logistic regression was used to determine whether or not an offender was likely to recidivate. The accuracy of the predictions for our logistic regression model was 67.74 percent without the removal of any protected characteristics that hold risk of being discriminated against unfairly, but it increased to 68.16 percent when race and gender were taken into account. The random Forest model revealed that, after accounting for the gender characteristic, the mean absolute error—the percentage of variance between each measurement and the quantity's actual value—was 34.06 percent along with an accuracy score of 65.94 percent. The main results drawn from this demonstrate that utilizing various models and measuring the precision, recall, and accuracy of each race and gender are comparable with or without protected characteristics. Although the accuracy of this still isn't the finest, it could demonstrate that bias may not be as significant a factor in decision-making as it may first appear. This, however, can also be contested because the dataset utilized to train these models could be encoding real world bias such that race and gender get encoded into other variables such as prior offenses; this would mean that even if we removed race and gender data it would still be present in our model through other variables. The question of whether or not we should remove protected characteristics is required and needed remains unanswered as a result.",
      "research_paper": "assets/pdfs/331be37a971db7be1b735d8c9e28933823b48c02.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.forbes.com/advisor/wp-content/uploads/2022/12/Criminal_Justice.jpeg-1.jpg",
      "headline": "Our research topic addresses the issue of whether or not an AI algorithm can be developed  to forecast whether or not a criminal would recidivate by removing protected characteristics from models in terms of both accuracy, precision and recall and their equality across different groups, as well as if such a tool is necessary",
      "project_id": "1c112a8fe4e6a3353c722d06b6f53e75d25bc422",
      "expand": true,
      "tags": [
        "Criminal Justice",
        "Recidivism",
        "Social Justice"
      ],
      "related_proj": [
        15,
        64,
        8
      ]
    },
    {
      "student_name": "Rohan S.",
      "mentor_name": "Sriram Hathwar",
      "mentor_title": "Princeton Alum, Bioinformatics Researcher",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Brain Tumor Classification",
      "project_desc": "Early classification and diagnosis of Brain Tumors is essential for providing the right treatment to a patient. It is crucial to get treatment as soon as possible because the survival rate for someone with an untreated brain tumor can range from as low as 3 months to as high as 5 years, which is why it is extremely important to get treatment as soon as possible. In this project, we used brain tumor MRI images to classify them into these 4 different categories: glioma, meningioma, pituitary, and no tumor. With the use of baseline and deep learning models, the deep learning models demonstrated a significantly higher performance due to their ability to analyze images. The model with the highest accuracy was the MobileNet model, a pre-trained transfer learning model trained on 5,608 images. This model yielded  a validation accuracy of 98.24%. Using metrics including Kappa cohen score, precision, and recall, we validated the performance of the machine learning model.   We deployed the MobileNet model to a web app using Streamlit, where users submit MRI images and receive diagnoses of tumor class.  We found that the model performed very well while utilizing the web app, indicating that it is safe to be used. However, since we only have 4 classes and there are over 150 total types of brain tumors, it could easily get a diagnosis wrong if it is not in one of these 4 classes.",
      "research_paper": "assets/pdfs/db2e298b8e470492951e248a761a9b01d373c6b4.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "github": "https://github.com/rohansangal1/Brain-Tumor-Classification",
      "graphic_link": "https://prod-images-static.radiopaedia.org/images/19319983/e8b196f5268ae6dc7f6915cbb48c88_big_gallery.jpeg",
      "headline": "Early classification and diagnosis of Brain Tumors are essential for providing the right treatment to a patient. It is crucial to get treatment as soon as possible because the survival rate for someone with an untreated brain tumor can range from as low as 3 months to as high as 5 years. In this project, we classified brain tumor images into 4 categories: glioma, meningioma, pituitary, and no tumor. With the use of baseline and deep learning models, the deep learning models demonstrated a significantly higher performance due to their ability to analyze images. The model with the highest accuracy was the MobileNet, a pre-trained transfer learning model trained on 5,608 images. This model yielded a validation accuracy of 98.24%. Using metrics including Kappa cohen score, precision, and recall, we validated the machine learning model's performance. We deployed the MobileNet model to a web app using Streamlit, where users submit MRI images and receive diagnoses of tumor class. We found that the model performed very well while utilizing the web app, indicating that it is safe to be used. However, since we only have 4 classes and there are over 150 total types of brain tumors, it could easily get a diagnosis wrong if it is not in one of these 4 classes.",
      "project_id": "3bdffe331f52081e0f2024f17e079d5ec940cc41",
      "expand": false,
      "tags": [
        "Cancer",
        "Brain Cancer",
        "Neuroscience"
      ],
      "related_proj": [
        67,
        12,
        37
      ]
    },
    {
      "student_name": "Arianna H.",
      "mentor_name": "Matteo Santamaria",
      "mentor_title": "Mathematical & Computational Engineering MS from Stanford, Data Scientist at infima",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Journalism"
      ],
      "project_title": "Biased News Detection Using Artificial Intelligence",
      "project_desc": "Biased news has become especially problematic in modern times. In this paper, we investigate the abilities of various machine learning models to correctly identify biased news. Our results indicate that artificial intelligence is very capable of doing this detection. In particular, both logistic regression and K-nearest neighbor classifier performed rather well in cross validation. ",
      "research_paper": "assets/pdfs/cdd9c0c92540083d70801edb3b5de1666857fc95.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.usnews.com/object/image/00000185-f52e-d39b-a98f-ff6e7bdf0000/gettyimages-1239793196.jpg?update-time=1674855937422&size=responsive640",
      "headline": "Biased news has become especially problematic in modern times. In this paper, we investigate the abilities of various machine learning models to correctly identify biased news. Our results indicate that artificial intelligence is very capable of doing this detection. In particular, both logistic regression and K-nearest neighbor classifier performed rather well in cross validation. ",
      "project_id": "75980cadee1c8968603f2a45662662cc2fe31db8",
      "expand": false,
      "tags": [
        "News",
        "Fake News",
        "Natural Language Processing"
      ],
      "related_proj": [
        60,
        27,
        42
      ]
    },
    {
      "student_name": "Giuliano T.",
      "mentor_name": "Sophia Barton",
      "mentor_title": "Computer Science MS from Stanford",
      "mentor_image": "assets/images/mentor_imgs/5fba3ab08aeaacfa77fdad7c012f4c97cd983c3a.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Environment",
        "Humanitarian Efforts and Social Justice"
      ],
      "project_title": "The Motions of Forest Fires",
      "project_desc": "Can I make an AI model that can predict how forest fires will move? I am trying to take data about the environment and a current fire and predict where the fire will go / if it will grow or shrink. Forest fires are burning more and more each year, as evidenced by the record breaking fires in Australia in 2020. The top ten years with the largest annual acreage burnt have all happened since 2004, and forest fires are now causing 7.4 million more acres of tree cover loss per year since 2001.\nThis project would hopefully let firefighters predict where the fire is going to prevent it. The data I used was a graph of where the fire was and other features such as the surrounding wind speed, terrain, plant content, etc, and then the label comes from another graph showing where the fire moved to. I tried several different models, namely a Multi Layer Perceptron (or Neural Net), Logistic Regression and Linear Regression before settling on a CNN that predicts if each square kilometer will have a fire or not. I then was unable to get this to work so I settled on making a model that predicts how dangerous the fire will be. I was eventually able to get it to predict this with 60% accuracy. The major conclusion I had with this problem is that it is very tough but it seems like there is a way to predict where a forest fire will go. I would like to keep researching to see if I can find out how.\n",
      "research_paper": "assets/pdfs/04bd09edf392cd60f2114e510cfa166a5b7a4990.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://insideclimatenews.org/wp-content/uploads/2023/03/wildfire_thibaud-mortiz-afp-getty-scaled.jpg",
      "headline": "Can I make an AI model that can predict how forest fires will move? I am trying to take data about the environment and a current fire and predict where the fire will go / if it will grow or shrink. ",
      "project_id": "e129d1129e9f9dc7f421566b7409f57da0680cff",
      "expand": false,
      "tags": [
        "Earth Systems",
        "Forest Fires",
        "Logistic Regression"
      ],
      "related_proj": [
        79,
        80,
        38
      ]
    },
    {
      "student_name": "Alex M.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance",
        "Published Papers"
      ],
      "project_title": "Applications of AI in Microfinance ",
      "project_desc": "Using AI models to predict who will be able to get a microloan",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://akm-img-a-in.tosshub.com/businesstoday/images/story/202007/investment_660x450_190220100047_200720121651.jpg",
      "headline": "I hope to explore how to use AI in the field of microfinance to help reduce income inequality. Microfinance has greatly helped decrease rural poverty rates in Bangladesh. The leader of this effort won the Nobel Peace Prize for his work. These micro-loans give opportunity to those who are not otherwise able to obtain financing for their entrepreneurial ideas. This can be applied in the U.S. too, in places where the population cannot otherwise obtain loans to start small businesses and climb their way out of poverty. It can be very difficult to start from rock bottom in the US, especially for those without access to resources. If people could obtain small loans and start small businesses, they could work their way out of poverty. The microloans have to be viable for banks as well. The problem I’d like to explore is whether AI/ML can be used to determine how to deploy microloans efficiently to address income inequality in the U.S.",
      "project_id": "aeb3a7e9bdee8ba99533d1e263521562419a8fb6",
      "expand": false,
      "tags": [
        "Economics",
        "Microfinance",
        "Inequality",
        "Published"
      ],
      "related_proj": [
        53,
        60,
        66
      ]
    },
    {
      "student_name": "Jaida G.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Skin Cancer Detection ",
      "project_desc": "The goal of this research project is to predict whether or not a patient has skin cancer through a machine learning model that is developed from an image dataset. Skin cancer is extremely dangerous, as over 9500 people in the US are diagnosed with it daily. If detected early, patients will have a more likely chance of survival. I tested an MLP Classifier, Decision Tree Regressor, a Logistic Regression Model, and a KNN Model to compare various results and ultimately determine the best accuracy. The MLP Classifier had a 74.5% accuracy, the Decision Tree Regressor had a 74.1% accuracy, the Logistic Regression Model had a 68.8% accuracy, and the KNN Model had a 74.6% accuracy (all testing). We can see that the MLP Classifier, Decision Tree Regressor, and the KNN Model had around the same accuracy while outperforming the Logistic Regression Model. However, when comparing training data, there seems to be a large overfitting problem with most of the models. ",
      "research_paper": "assets/pdfs/5287c08277891732a6dab1b489416e15849b62e9.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.cnet.com/a/img/resize/003ff7bf85a1a57a2a57fcf043b9160f6a47a9d7/hub/2019/06/26/b2b042fc-4ae0-4a80-9ae7-11cd7eba0a59/skinvision.jpg?auto=webp&width=1200",
      "headline": "The goal of this research project is to predict whether or not a patient has skin cancer through a machine learning model that is developed from an image dataset. Skin cancer is extremely dangerous, as over 9500 people in the US are diagnosed with it daily. If detected early, patients will have a more likely chance of survival. I tested an MLP Classifier, Decision Tree Regressor, a Logistic Regression Model, and a KNN Model to compare various results and ultimately determine the best accuracy. The MLP Classifier had a 74.5% accuracy, the Decision Tree Regressor had a 74.1% accuracy, the Logistic Regression Model had a 68.8% accuracy, and the KNN Model had a 74.6% accuracy (all testing). We can see that the MLP Classifier, Decision Tree Regressor, and the KNN Model had around the same accuracy while outperforming the Logistic Regression Model. However, when comparing training data, there seems to be a large overfitting problem with most of the models.",
      "project_id": "14fe693153a6a674ce2cf5f7b2028b54c56e3b8a",
      "expand": false,
      "tags": [
        "Cancer",
        "Diseases and Health Conditions",
        "Skin Cancer"
      ],
      "related_proj": [
        29,
        43,
        69
      ]
    },
    {
      "student_name": "Roberto T.",
      "mentor_name": "Sophia Barton",
      "mentor_title": "Computer Science MS from Stanford",
      "mentor_image": "assets/images/mentor_imgs/5fba3ab08aeaacfa77fdad7c012f4c97cd983c3a.png",
      "student_image": "assets/images/student_imgs/ed209204772644abae275cace7df30983e797a0f.png",
      "domains": [
        "Physics",
        "Published Papers"
      ],
      "project_title": "Stellar Classification based on Numerous Characteristics using Machine Learning",
      "project_desc": "The task of stellar classification can be tedious and\nlengthy when done manually. One can expedite stellar classifi-\ncation by creating an artificial intelligence model to automate\nthe process. As we as a species continue to explore the frontier\nof the observable universe, we should seek to automate time\nintensive problems like stellar classification. The current stellar\nclassification model serves to effectively categorize stars for re-\nsearch purposes regarding their distribution around the universe,\nso automating the development of this resource would allow\nprofessionals to allocate more time to explore the bounds of our\ncurrent understanding of space and the universe. After finding\nand analyzing a dataset containing numerical and categorical\nfeatures, a supervised learning approach was then used to train\nand test different models on their ability to classify the stars\nin the given test set. A Decision Tree Classifier, Random Forest\nClassifier, Ridge Classifier, and Support Vector Classifier were\ntrained and tested using the data. The most successful models\nwere the Decision Tree Classifier and Random Forest Classifier,\neach with about a 94 percent prediction accuracy across different\naccuracy metrics on the test data. Despite some drawbacks in\nregards to the availability of usable data, four models were\ntrained and two were proven to be consistently and successfully\naccurate. Any future attempts at developing models for stellar\nclassification should concentrate more on gathering data as to\nhave a more thoroughly trained set of models.",
      "research_paper": "assets/pdfs/7b342766e5c2f5ed3fcf18d4910c0e3513323044.pdf",
      "project_yr": "2022",
      "project_quarter": "Fall",
      "graphic_link": "https://www.universetoday.com/wp-content/uploads/2008/11/tarantula.jpg",
      "headline": "The task of stellar classification can be tedious and lengthy when done manually. One can expedite stellar classification by creating an artificial intelligence model to automate the process. The current stellar classification model serves to effectively categorize stars for research purposes regarding their distribution around the universe, so automating the development of this resource would allow professionals to allocate more time to explore the bounds of our current understanding of space and the universe. After finding and analyzing a dataset containing numerical and categorical features, a supervised learning approach was then used to train and test different models on their ability to classify the stars in the given test set. A Decision Tree Classifier, Random Forest Classifier, Ridge Classifier, and Support Vector Classifier were trained and tested using the data. ",
      "project_id": "5ee1177c671abf3e11897fc2ebbba3e1355573d4",
      "expand": true,
      "tags": [
        "Astronomy",
        "Stellar Classification",
        "Published"
      ],
      "related_proj": [
        31,
        50,
        12
      ]
    },
    {
      "student_name": "Sofia S.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Stock Prediction Project",
      "project_desc": "As of 2022, 60%-73%  of the trading volume done in the U.S stock market is done by algorithms, illustrating the dependency and importance of these types of algorithms in stock predictions. Additionally, a recent census by Gallup shows that 145 million Americans (roughly 56% of the population) invest and own stocks, showing the population’s keen interest in the stock market. \nAnother key motivator is by understanding these sophisticated learning algorithms, we are better equipped to understand the market and current state of the economy, permitting us to take necessary courses of action and make informed decisions. As such, I endeavored to create a model that takes into account opening, closing, high, and low prices from the last 3 days to predict the opening price on the fourth day. Of course, the model is not just limited to only being able to approximate the opening price the following day; for example, it will also be able to predict the opening price 5 days later. ",
      "research_paper": "assets/pdfs/b9feb8e9d9231825cb36f6019b61c456255ddc9b.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://images.pexels.com/photos/534216/pexels-photo-534216.jpeg?cs=srgb&dl=pexels-pixabay-534216.jpg&fm=jpg",
      "headline": "As of 2022, 60%-73%  of the trading volume done in the U.S stock market is done by algorithms, illustrating the dependency and importance of these types of algorithms in stock predictions. Additionally, a recent census by Gallup shows that 145 million Americans (roughly 56% of the population) invest and own stocks, showing the population’s keen interest in the stock market. I endeavored to create a model that takes into account opening, closing, high, and low prices from the last 3 days to predict the opening price on the fourth day. Of course, the model is not just limited to only being able to approximate the opening price the following day; for example, it will also be able to predict the opening price 5 days later. ",
      "project_id": "46f8f5cffd6a043c8ef551cda8fb252a7fd93aae",
      "expand": false,
      "tags": [
        "Stocks",
        "Economics"
      ],
      "related_proj": [
        17,
        60,
        25
      ]
    },
    {
      "student_name": "Alexander K.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/student_imgs/1caba83d416e904cc9825df2efc3671329560b34.png",
      "domains": [
        "Environment"
      ],
      "project_title": "Machine Learning Algorithms for Consumer Plastics Identification and Sorting",
      "project_desc": "Seeking a solution to maintain plastic recycling costs while increasing the output of reusable material, this paper poses the question “what type of machine learning algorithm is most suitable for a plastic identification system in consumers’ homes?” It investigates five total machine learning algorithms to determine which one best balances accuracy, management of resources, and time efficiency, ultimately arriving at the conclusion that a Support Vector Machine that uses a Polynomial Kernel is the best algorithm and serves to demonstrate that algorithms such as the ones analyzed have become advanced enough for more efficient, AI driven systems to replace those of the status quo.",
      "research_paper": "assets/pdfs/77ff4191da8256dcdeac81ff046d787fa8c61cea.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://waste-management-world.com/imager/media/wasteManagementWorld/2231185/AdobeStock_320996375_428fd902f4247199467725e7eccf1673.jpeg",
      "headline": "Seeking a solution to maintain plastic recycling costs while increasing the output of reusable material, this paper poses the question “what type of machine learning algorithm is most suitable for a plastic identification system in consumers’ homes?” It investigates five total machine learning algorithms to determine which one best balances accuracy, management of resources, and time efficiency, ultimately arriving at the conclusion that a Support Vector Machine that uses a Polynomial Kernel is the best algorithm and serves to demonstrate that algorithms such as the ones analyzed have become advanced enough for more efficient, AI driven systems to replace those of the status quo.",
      "project_id": "419f2aa1abd6d04e1bb0ee5d9ed0f798c461d94a",
      "expand": true,
      "tags": [
        "Earth Systems",
        "Recycling"
      ],
      "related_proj": [
        58,
        55,
        77
      ]
    },
    {
      "student_name": "Matthew N.",
      "mentor_name": "Sarthak Kanodia",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Environment"
      ],
      "project_title": "A Comprehensive Study of Machine Learning Models for the Prediction of pH in Fairfax County",
      "project_desc": "Water quality is drastically declining as bodies of water \nbecome more and more acidic due to global warming. \nBecause of this, it is crucial to understand what factors \ndetermine pH, and how to predict pH values. In this study, \nwe determine which features are most important in \ndetermining pH, and also what combination of features and \nmachine learning models give us the best accuracy in the \nprediction of pH values. We demonstrate that pH values \nfrom the previous year and the percentage of rehabilitated \nsanitary sewer lines are the most important features in \ndetermining pH. We also demonstrate that Decision Tree \nModels and Random Forest Models perform the best across \nall features and feature subsets.",
      "research_paper": "assets/pdfs/c423ee893b24bf4a7d44b90f31f8fa91dfd74289.pdf",
      "project_yr": "2023",
      "project_quarter": "Spring",
      "graphic_link": "https://assets.entail.ai/mayuwater/Steps_to_Naturally_Increase_the_pH_of_Drinking_Water-1662358595211.jpg",
      "headline": "Water quality is drastically declining as bodies of water become more and more acidic due to global warming. Because of this, it is crucial to understand what factors determine pH, and how to predict pH values. In this study, we determine which features are most important in determining pH, and also what combination of features and machine learning models give us the best accuracy in the prediction of pH values. We demonstrate that pH values from the previous year and the percentage of rehabilitated sanitary sewer lines are the most important features in determining pH. We also demonstrate that Decision Tree Models and Random Forest Models perform the best across all features and feature subsets.",
      "project_id": "e99ba3f040d469c86d17bed3f2bdd03a9f653c89",
      "expand": true,
      "tags": [
        "Earth Systems",
        "Chemistry",
        "Water"
      ],
      "related_proj": [
        68,
        77,
        40
      ]
    },
    {
      "student_name": "James W.",
      "mentor_name": "Aidan Donaghey",
      "mentor_title": "Physics Yale Alumni, Researcher in Bioinformatics and Astrophysics",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/d9570f7587545e42733102bbef7266fdb3f58c5b.png",
      "domains": [
        "Physics"
      ],
      "project_title": "Molecular Analysis of Stellar Clusters Final Paper",
      "project_desc": "WIth the diversity of research methods and measurement instruments found in astronomy, it is often difficult to draw direct comparisons between conclusions due to differences in both kind and quality of measurements.   By using a machine learning algorithm we have been able to predict measurements that may not have been gathered, notably , the iron content of a star based upon temperature or gravity readings. The problem has not been answered before with this data set, and the scientific community does not have a large amount of research that has pertained to this specific APOGEE data release. By addressing this previously unaddressed problem, we can advance the scientific community with a new contribution that allows scientists of the future to gain additional data in conditions where such data may not be so readily available. We have approached the question by using various machine learning algorithms to discover correlations between the data points we were given, creating a predictive model to produce a numerical result. Gravity and temperature do not present a direct linear relationship to the iron content of a star. However, as their data points tend to cluster together, we can utilize the KNeighborsRegressor to find correlations in the way that these points have, and produce a numerical prediction. Throughout testing we’ve found that the KNeighborsRegressor does better on all accounts in comparison to a large variety of other regression models such as the GaussianProcessRegressor. Considering the results of the Mean Absolute Percentage Error function upon the results of both of these, we can note how the LinearRegressor, mathematically, does marginally better than the KNeighborsRegressor, at a value of 1.13% of average error in comparison to 2.53%. ",
      "research_paper": "assets/pdfs/52f277b11a08398d811fce53cf85e6dbfc8a7f4e.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.astronomytrek.com/wp-content/uploads/2017/03/Jewel-Box-star-cluster-1280x720.jpg",
      "headline": "By testing a multitude of models from the python package scikit-learn upon the APOGEE dataset, we’ve managed to produce a resultant product that can predict a star’s iron concentration depending upon its gravitational pull (LOGG) value or effective temperature (TEFF) value.",
      "project_id": "28be4b1740f489c7b5116dfe0095211e74b1cfea",
      "expand": false,
      "tags": [
        "Star Clusters",
        "Astronomy"
      ],
      "related_proj": [
        52,
        65,
        61
      ]
    },
    {
      "student_name": "Krishang S.",
      "mentor_name": "Matan Gans",
      "mentor_title": "Computer Science MS at Brown",
      "mentor_image": "assets/images/mentor_imgs/3d3ad41beef6202228995b3c6fea47175bcd03bd.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Predicting the ask price in options using different machine learning methods",
      "project_desc": "The goal of this project is to determine how to predict important aspects of options, including ask price. We want to compare different machine learning models to learn the best model and the best hyperparameters for that model for this purpose and dataset. Option pricing is a relatively new field and it can be very complicated and intimidating, especially to inexperienced people, so we want to create a machine learning model that can predict important aspects of an option stock which can aid in future research. We tested multiple different models, and experimented with hyperparameter tuning trying to find some of the best parameters for a machine learning model. We tested three different models; a Random Forest Regressor, a linear regressor, and a MLP (multi-layer perceptron) regressor. The most important feature in this experiment is the ask price, this is what we were trying to predict. The initial Random Forest Regressor had a mean error of 7.02 and the initial MLP regressor had a mean error of 13.96. The Initial Random Forest Regressor had almost 50% less errors than the MLP regressor which continued to be true even as the error average improved with hyperparameter tuning. The Random Forest Regressor is shown to be more efficient than a simple MLP regressor. Also we can predict the ask price with moderate accuracy using a machine learning model.",
      "research_paper": "assets/pdfs/456fa98318c02afe28119f8bf124e96b4e18b53c.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://mediacloud.kiplinger.com/image/private/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1658173581/Investing/stock-market-today-071822.jpg",
      "headline": "The goal of this project is to determine how to predict important aspects of options, including ask price. We want to compare different machine learning models to learn the best model and the best hyperparameters for that model for this purpose and dataset.",
      "project_id": "b795db3cf4c696d355a5a3e80d98d23957a24a4a",
      "expand": true,
      "tags": [
        "Stocks",
        "Options",
        "Economics"
      ],
      "related_proj": [
        53,
        72,
        60
      ]
    },
    {
      "student_name": "Arpan A.",
      "mentor_name": "Mirna Kheir Gouda",
      "mentor_title": "Biomedical Engineering PhD Candidate at MIT",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/e3702402970e0a9dd8984c10b240e255ff68fa34.png",
      "domains": [
        "Environment"
      ],
      "project_title": "Most Important Soil Properties to Consider for High Crop Yield",
      "project_desc": "With the current population of Earth massively growing, there is a real risk coming up in the near future of not having enough food to feed the planet. One of the best ways to solve this upcoming problem is to improve the quality of the soil because that will help increase Earth’s overall crop yield in a sustainable way. However, figuring out how to improve soil can be a big challenge since there are so many elements and properties of soil to analyze. To help solve this problem we looked into the elements or properties of soil that could have the biggest influence on soils ability to be productive for growing crops. We found online datasets and used unsupervised machine learning by applying both principal component analysis (PCA) and hierarchal clustering on our data. We concluded that calcium, potassium, pH, and soil organic carbon are the elements or properties of soil that have the biggest influence on soil's ability to be productive for growing crops. If these results are accurate, it can massively help many farmers and people in improving their soil quality. This can lead to us taking a big step in the direction of increasing Earth’s overall crop yield.  ",
      "research_paper": "assets/pdfs/6db01dae04a368907c9e65aed25f76c0199aa535.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://www.allaboutarizonanews.com/wp-content/uploads/2019/01/CottonField.PhoenixAZ.140320-1-1080x608.jpg",
      "headline": "With the current population of Earth massively growing, there is a real risk coming up in the near future of not having enough food to feed the planet. One of the best ways to solve this upcoming problem is to improve the quality of the soil because that will help increase Earth’s overall crop yield in a sustainable way.",
      "project_id": "c8ddc52adbc15aa68fc701cde83fd2e65d2e5fcd",
      "expand": false,
      "tags": [
        "Earth Systems",
        "Irrigation",
        "Water Use"
      ],
      "related_proj": [
        41,
        55,
        59
      ]
    },
    {
      "student_name": "Audrey W.",
      "mentor_name": "Matthew Radzihovsky",
      "mentor_title": "Computer Science MS from Stanford, AI/ML Engineer at Apple",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Environment"
      ],
      "project_title": "Prediction of Nitrogen Dioxide Level using Machine Learning Models",
      "project_desc": "Air pollution has been a lingering problem to many developing countries. Overpopulated cities and unregulated industrial and vehicle emissions constantly destroy the natural environment and harm human health. Being one of the most common air pollutants, nitrogen dioxide, also known as NO2, damages our respiratory system, destroys aquatic food chains, and contributes to the formation of acid rains. In this paper, linear regression, random forest regressor and decision tree regressor from scikit learn are used to predict NO2 level in parts per million (ppm) by analyzing its correlation with other air pollutants in a specific city. The model achieved an accuracy of 69,1 percent using  random forest and a 66 percent accuracy using decision tree. The accuracy of the model can increase with a more detailed dataset, but further scientific research and discovery are required to actually predict acid rain based on just NO2, since the amount of NO2 that will cause acid rain is uncountable and many more variables go into the formation of acid rain. ",
      "research_paper": "assets/pdfs/f6fb83c933cc866c2ba1130446fe194173bd6b18.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://images.newscientist.com/wp-content/uploads/2017/05/02163148/p8713477-2.jpg",
      "headline": "As we release more pollution into the atmosphere as factory and vehicle byproducts, acid rains are formed and are constantly damaging the environment and harming wildlives under and above the ocean. If the occurrence of acid rains can't be limited, the phenomenon of this man-made disaster will threaten the health and safety of billions. By predicting the potential development of acid rain  with nitrogen dioxide (NO2) levels, one of the major components of acid rain, we could prevent it by limiting the number of specific gasses produced.",
      "project_id": "06ce4752b575b0bee26c2b7e67d42f6b372107ab",
      "expand": false,
      "tags": [
        "Earth Systems",
        "GHGs",
        "Pollution"
      ],
      "related_proj": [
        54,
        41,
        40
      ]
    },
    {
      "student_name": "Pranav B.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance",
        "Journalism"
      ],
      "project_title": "The Effect of the News on the Stock Market",
      "project_desc": "\tUnderstanding how the stock market works is an essential skill in life. Investing properly can lead to security and stability in financial life, but it is hard to find a way to do it consistently. This brought up the question of automating this skill. This is what this paper is about. Using a CNN() and Hugging Face’s Transformers() model, we created a sentiment analysis model that can provide both the certainty of the sentiment and the sentiment itself. The higher the certainty, the more likely it is that the stock will increase in the near future. The CNN and Transformers models both yielded exceptional results, with the Transformers model beating out the CNN model by a mere 1%. This means that the Transformers model was more accurate in predicting the sentiment of sentences than the CNN model was, but only by a little bit. The dataset used consisted of three columns: title, stock, and date. The ‘date’ column will not be used, but the title and stock columns will be used to train the model and display graphs. The purpose of this machine is not to control a buyer’s account and only make purchases that will be guaranteed successes in the short run; it is to provide the buyer with exterior information unwittingly to the buyer so they can make a more educated decision.",
      "research_paper": "assets/pdfs/a9c43a3dbebd662e1352c6324f75bcab2c2e9fb5.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://u3j7m9h7.rocketcdn.me/wp-content/uploads/2022/05/stock-market-today-2-scaled.jpeg",
      "headline": "I remember opening my investing account one day and looking at my stocks, noticing that the majority of them were declining pretty severely. Ever since the Russia and Ukraine war, this had been the case. I saw many news headlines talking about the market, and how it was affected from this war. It was then I realized, why isn’t there a way for us to predict these changes in the market given sufficient news headlines?",
      "project_id": "37257d19224d7273a2d23c327ef99bef57d8d424",
      "expand": false,
      "tags": [
        "Stocks",
        "News",
        "Economics"
      ],
      "related_proj": [
        14,
        7,
        42
      ]
    },
    {
      "student_name": "Isaac A.",
      "mentor_name": "Aidan Donaghey",
      "mentor_title": "Physics Yale Alumni, Researcher in Bioinformatics and Astrophysics",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Physics"
      ],
      "project_title": "An Investigation Into Applications of Machine Learning Algorithms on Solar Flare Data and Distance Prediction",
      "project_desc": "A solar flare is an intense localised eruption of electromagnetic radiation in the sun’s atmosphere. A solar flare is typically accompanied with a coronal mass ejection (CME), in which a highly magnetic plasma is released from the sun’s corona into the heliosphere. CMEs are capable of reaching earth and colliding with the earth’s magnetic field, causing dangerous geomagnetic storms that can start fires and cause power outages. It is imperative that flares are studied so that actions can be taken to mitigate the effect of geomagnetic storms. Our data was sourced from the RHESSI telescope which consisted of almost 100,000 entries. It was shown in Fletcher’s paper that there exists a correlation between radial distance and the energy of a flare. We began with classifying solar flares based on their radial distances and then applying machine learning models like logistic regression, KNN classification, Decision Trees and MLP Classification and closely examining the ones that gave the highest accuracy. Our different machine learning models showed that there existed a pattern in the phenomena of solar flares and our AI could be used to predict them accurately. Most notably, the decision tree model had an accuracy of 99.84%.\n",
      "research_paper": "assets/pdfs/df76dbf0c48726c884f7cde63359a8e2ebcd47ae.pdf",
      "graphic_link": "https://www.slashgear.com/img/gallery/heres-how-solar-storms-can-impact-the-earth/solar-flares-and-earth-1663205183.jpg",
      "headline": "The current method that NASA uses for flare prediction involves studying various solar cycles that range from 11 days to 80 years. However, there are far too many factors to consider using this method of prediction and the forecasts are often wrong.",
      "project_id": "3da55ed927a10c8aac6d7150c913ad187e288721",
      "expand": true,
      "tags": [
        "Astronomy",
        "Solar Flares"
      ],
      "related_proj": [
        70,
        65,
        56
      ]
    },
    {
      "student_name": "Bwohan W.",
      "mentor_name": "Barbie Duckworth",
      "mentor_title": "Computer Science BS Alumni MIT, prior Software Engineer at Facebook and eBay",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/9b6f95b9b7dce42365164c342b640161dc3bfe9c.png",
      "domains": [
        "Healthcare and Biology",
        "Psychology"
      ],
      "project_title": "Training a Machine Learning Model to Recognize Signs of Depression",
      "project_desc": "Depression is a common mental disorder yet can severely damage your everyday habits and health. It is also difficult to diagnose without a professional assessment, so it can be hard to identify whether or not you have it. However, some everyday habits, and changes in those habits, can be indicative of future depressive episodes. Pinpointing those features, I trained a KNN and decision tree based models to predict whether or not someone would have a depressive episode in the future. The best performing model was a KNN model which had an accuracy of 70%, with an F1 score of 69%. These statistics, while not insignificant, still need to be improved on before they can be used as a reliable predictor of depression.",
      "graphic_link": "https://images.everydayhealth.com/images/how-to-cope-with-anxiety-and-depression-722x406.jpg",
      "headline": "Many people have not had a professional diagnosis, and could have depression without being aware of it. To attempt to answer this question, I used a person’s daily habits and how they change, and attempt to predict if they will experience a depressive episode in the future.",
      "project_id": "668fe721f198b9326694fc2f33856dcef5f31f81",
      "expand": false,
      "tags": [
        "Mental Health",
        "Depression",
        "Diseases and Health Conditions"
      ],
      "related_proj": [
        18,
        71,
        21
      ]
    },
    {
      "student_name": "Justin H.",
      "mentor_name": "Christina Cheng",
      "mentor_title": "Materials Science and Engineering PhD Candidate at Stanford, ",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Does Physiology Really Help a Volleyball Player Succeed?",
      "project_desc": "During my research project, I aimed to answer my main research problem of whether or not a person’s physiology affected their performance in women’s volleyball. It has always been assumed that a better physiology allows players to succeed in all sports, but I wanted to see if this was the case for volleyball. From previous research done by Sciendo, it has been shown that height is a core value for volleyball players, as it has a higher chance of helping a player succeed if they are taller. Although this is the case, they also found that Japanese volleyball players, who were shorter than the average professional volleyball player, were able to succeed and play at a high level. The overall approach used to answer this question was to see if there was any correlation between a player’s Ranking and their physiology (height, weight, spike, and block). I used a dataset named “Best Volleyball Players 2019” from Kaggle that displayed a wide range of women’s volleyball players and their different attributes along with their ranking. From the results that I have collected, the major conclusions in relation to my main question was that a person’s physiology did not affect their performance and ranking. The number for my error was large, meaning that you did not need to have a more optimal physiology to succeed in volleyball and be higher on the rankings. ",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://volleycountry.com/wp-content/uploads/2017/05/volleyball-attack-kurek-1080x650.jpg",
      "headline": "As a child, I always went to my sister’s volleyball games. From club games to school games, I went to them all. Because I saw so many volleyball games by watching my sister’s games, I always saw that there was always a trend that I kept seeing from each team.",
      "project_id": "0f5df92f9d5f434d7216389869ded3e6ce721194",
      "expand": false,
      "tags": [
        "Physiology",
        "Sports",
        "Vollyball"
      ],
      "related_proj": [
        51,
        69,
        75
      ]
    },
    {
      "student_name": "Alexander F.",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "PoliSci and Law"
      ],
      "project_title": "Predicting Recidivism in the United States Criminal Justice System",
      "project_desc": "We investigated how artificial intelligence creates bias in the US criminal justice system. Recidivism prediction algorithms used in courtrooms have been shown to produce unnecessarily harsh risk assessment scores against Black individuals, leading them to have more strict bail guidelines. This contributes to a greater narrative against Black Americans. In order to explore how different algorithms might be biased in predicting recidivism, we used 3 different classification models to predict whether individuals in the Virginia Felony Database dataset would recidivate. We tested three different (optimized) machine learning algorithms — Logistic Regression, Random Forest, and k-nearest-neighbors and compared the resulting confusion matrices to determine which was the most effective. The final Logistic Regression model had a final accuracy of 70.44%; the Random Forest algorithm had the best at 75.64% and K-nearest-neighbors had 72.24%. All algorithms had a greater false positive (false arrest prediction) for white individuals, likely due to the dataset containing many examples of white criminals. In our model white defendants were discriminated against because of data bias, which demonstrates how algorithms can treat different racial groups differently depending on the data that goes in. Given historical bias, we can see how this same pattern could occur in the opposite direction favoring white individuals more frequently in other datasets.",
      "research_paper": "assets/pdfs/6d7ebe606bfd552e39df982e18bff9413d4021f0.pdf",
      "graphic_link": "https://www.povertyactionlab.org/media/image/20170505-recidivismjpg",
      "headline": "There are real-life effects of machine bias in courtrooms. American lives are completely changed based on criminal sentencing, which can mean the difference between rehabilitation and recidivism. This issue is urgent and finding a solution to ensure equality is imperative.",
      "project_id": "3b1e19d91a523f901204bc8995c84da97f5085cd",
      "expand": false,
      "tags": [
        "Criminal Justice",
        "Recidivism",
        "Law and Order"
      ],
      "related_proj": [
        15,
        8,
        46
      ]
    },
    {
      "student_name": "Eesha S.",
      "mentor_name": "Victoria Lloyd",
      "mentor_title": "PhD Student in Physics, Prior Research Collaborator at Caltech, ",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Physics"
      ],
      "project_title": "Gamma Ray Classification",
      "project_desc": "The focus of this research project is to be able to classify high-energy gamma particles as signal or background. It is important to solve this issue, as it allows us to explore phenomenas that we are unable to see on Earth. High energy gamma particles are also a major part of particle physics. Research in particle physics has helped us in the world of medicine, in drug development, along with exploring more about matter that makes up our world. I created a model that classifies a particle as signal or background based on given test features that I was able to get from the NASA MAGIC Gamma Telescope experiment. This was accomplished by creating an ML model and following the process of training, predicting, and evaluating to test various models. I found the accuracy score of the model, created a confusion matrix, and calculated the f1 score for all the models. For the final model, I got an accuracy score of 88.44% and an f1 score of about 0.883, allowing me to finally find a model that classifies the high energy gamma particles with the highest accuracy. ",
      "research_paper": "assets/pdfs/1b98ab588e67f604859ebb273dcb5e3e5affc1c8.pdf",
      "project_yr": "2022",
      "project_quarter": "Summer",
      "graphic_link": "https://scx2.b-cdn.net/gfx/news/2020/aregammarayb.jpg",
      "headline": "This research paper is in this domain of physics, specifically using Artificial intelligence (AI) to classify high-energy Gamma particles as background or signal. I was able to create an AI model to classify these gamma particles with high accuracy. I was able to accomplish this by using a wide range of data, from the MAGIC Gamma Telescope Dataset, which consists of key features, to construct a model.",
      "project_id": "22b10a274fc2ce6a3c295b663210ee33b1ec2c1f",
      "expand": false,
      "tags": [
        "Astronomy",
        "Gamma Rays"
      ],
      "related_proj": [
        31,
        61,
        52
      ]
    },
    {
      "student_name": "Jackson D.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Stock Price Prediction Project ",
      "project_desc": "I chose this project because I have a very strong interest in not only the stock market, but in finance overall. In early 2021, I began investing in and learning about the stock market with the help of my dad, a financial advisor. As I was first exploring the market I was making investing mistakes left and right, but they helped me to understand how to safely invest and recognize risk.",
      "research_paper": "assets/pdfs/261cdffc68b9cc8692f0186fa19104de18b3309f.pdf",
      "graphic_link": "https://miro.medium.com/max/1400/1*NpT5pyemQQsGEHXbfS51Zw.png",
      "headline": "Can an Algorithm be created to accurately predict the stock price of any company on a given day? Within my project, I'm trying to create a code that can accurately predict any stock's price on a given day.",
      "project_id": "f683e1d4a650c96016d4ffe63a20874a15c28487",
      "expand": false,
      "tags": [
        "Stocks",
        "Economics"
      ],
      "related_proj": [
        53,
        25,
        78
      ]
    },
    {
      "student_name": "Keithan P.",
      "mentor_name": "Eric Bradford",
      "mentor_title": "Electrical Engineering and Computer Science Masters from MIT, Technical PM at Apple",
      "mentor_image": "assets/images/mentor_imgs/1c6e0145b739e5e8514f37fc9548d17022d2535f.png",
      "student_image": "assets/images/student_imgs/6904fe8bf639f5c719de88741e9d1a5cdbcfc4ce.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Predicting Skin Cancer using Machine Learning",
      "project_desc": "The motivation for this research project was to create an accurate model that could be used to identify the presence of different types of skin cancers. The latter objective is to create an application that could be easily used in rural areas, as they do not have access to modern medical technology. The approach began with loading the dataset into a readable format. I used the load_dataset import from Hugging Face [4] to complete this task. The models that were used for this research project were all from Hugging Face [4]. The highest accuracy was 0.8633 and the lowest accuracy was 0.6647. The models were all run on a colab notebook. The meaning of these results is that on the best model the image was predicted correctly 86% of the time. The conclusion of this research is that more research must be conducted and more models must be used in order to achieve an accuracy that would warrant the model to be used in the real world.",
      "research_paper": "assets/pdfs/7fc8bcd4e544090345a2eada393c88b1c67aed1c.pdf",
      "project_yr": "2022",
      "project_quarter": "Spring",
      "graphic_link": "https://images.everydayhealth.com/images/how-is-skin-cancer-diagnosed-722x406.jpg",
      "headline": "Skin cancer affects an increasing number of people which is the main motivation for my research. The goal is to develop a model that is accurate enough for real world application and that could be distributed to more rural areas which have decreased access to medical technology.",
      "project_id": "949e6f3e9e51ef95bc5426b1288aa28d9cd465d9",
      "expand": false,
      "tags": [
        "Skin Cancer",
        "Diseases and Health Conditions",
        "Cancer"
      ],
      "related_proj": [
        41,
        21,
        22
      ]
    },
    {
      "student_name": "Ian C.",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/2c3734b0dabdeab847e102603847be85cefb2344.png",
      "domains": [
        "Environment"
      ],
      "project_title": "Using Logistic Regression in the Early Detection of Tsunamis caused by Earthquakes",
      "project_desc": "Tsunamis have forced large financial investments devoted to their preparation and repair. One primary cause of such tsunamis are earthquakes, often those occurring nearby. By using processed NCEI/WDS datasets for earthquakes and tsunamis, we built a logistic regression model to predict the probability a tsunami would form following a given earthquake using features such as magnitude and location with an accuracy of around 80%. In addition, a linear regression model was used to predict the resulting tsunami’s size, although it had low efficacy. ",
      "research_paper": "assets/pdfs/65d96623dbb39e8adc85aea5d1c4803112a66d13.pdf",
      "github": "https://github.com/Ian-Inspirit-AI-Code/DataProcessing",
      "graphic_link": "https://cdn.britannica.com/83/232283-050-7194EBA7/Tsunami-hits-sea-Miyako-Japan-March-11-2011.jpg",
      "headline": "Many tsunamis have enough energy to cause a large amount of human death, as well as trillions of dollars in damage repair. The problem arises on how to better prepare for these natural disasters and limit its damage, especially in countries such as Japan that are frequented by tsunamis.",
      "project_id": "ccfcd2d500fd177b3719b2a5ffec20d8a7b703ed",
      "expand": true,
      "tags": [
        "Logistic Regression",
        "Earth Systems",
        "Natural Disasters"
      ],
      "related_proj": [
        20,
        58,
        32
      ]
    },
    {
      "student_name": "Animish J.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Optimizing Skin Cancer Classifiers By Applying Multiplicative Weight Update Into A Mobile Application",
      "project_desc": "This study deals with using Artificial Intelligence and Machine Learning in order to create models that can diagnose skin cancer using images. Many models have been created in the past using different algorithms and methods. In this study, the multiplicative weight update method is used in order to take the predictions of multiple models in order to try and acquire more accurate predictions. In this study, a Logistic Regression, CNN, and SVC model are used. These models are sent images of skin cancer from the ISIC-Archive and they try to recognize patterns in order to categorize new images. These models are all then sent to a multiplicative weight update algorithm which takes into account the precision and accuracy of each model through each successive guess in order to add weight to their guess. These guesses are then added together in order to try and find the correct predictions. Using Multiplicative Weight Update, the model received an accuracy of 74.69%. The conclusion was made that using an SVC  model would be the best option for this problem rather than a Multiplicative Weight Update system. \n",
      "research_paper": "assets/pdfs/0e313744bc3f9c40120b0cc546ee54b273648f23.pdf",
      "graphic_link": "https://res2.yourwebsite.life/res/5f7f15d2dd43c80022ec7b78/5f7fa95496628c00210b889e_optimized.webp",
      "headline": "Skin cancer is slowly becoming the most common and frequent type of cancer in the world. In the United States alone, research suggests that skin cancer is the most common cancer in and that one in every five people will acquire skin cancer at some point throughout their lifetime.",
      "project_id": "a11279d957e8a60c671b45c11106105670960e49",
      "expand": true,
      "tags": [
        "Skin Cancer",
        "Diseases and Health Conditions",
        "App Development",
        "Cancer"
      ],
      "related_proj": [
        29,
        76,
        51
      ]
    },
    {
      "student_name": "Alice H.",
      "mentor_name": "Tony Rodriguez",
      "mentor_title": "PhD Candidate in Astrophysics at Caltech",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/84229884cba35fe4956e6f77fe5cec7245c1caaa.png",
      "domains": [
        "Physics",
        "Published Papers"
      ],
      "project_title": "A Hybrid CNN-LSTM Model For Predicting Solar Cycle 25",
      "project_desc": "The solar cycle is linked to the number of visible sunspots and follows the fluctuations of the Sun’s magnetic field. It can have powerful global impacts on the Earth. Thus, predicting the timing and amplitude of the peak of the incoming solar cycle 25 is of great importance. This study uses a hybrid deep learning CNN-LSTM model and observed 13-month smoothed sunspot numbers to predict Solar Cycle 25. The MinMax normalization substantially reduces the error of the CNN-LSTM model’s solar cycle predictions compared to the Standard Deviation normalization. The results suggest that it is best to use four historical solar cycles to predict the future solar cycle. The predicted Solar Cycle 25 will have a peak amplitude similar to the 13-month smoothed peak of solar cycle 24. The predicted solar cycle 25 peak spans a relatively long period of time between approximately August 2023 and July 2024. ",
      "graphic_link": "https://media.wtsp.com/assets/WTSP/images/20519ffa-0230-435b-8f2b-46718cd853c8/20519ffa-0230-435b-8f2b-46718cd853c8_750x422.jpg",
      "headline": "The goal of this study is to predict Solar Cycle 25 through the deep learning approach,and determine what parameters affect prediction accuracy and what the optimal number of historical solar cycles are used to reliably and accurately predict the upcoming solar cycle. The solar cycle predictions will help us prepare ahead of time for future solar activity.",
      "project_id": "073776ccdb02a715b1a9c4ea590c72703600cadc",
      "expand": false,
      "tags": [
        "LSTMs",
        "Solar Cycles",
        "Astronomy",
        "Published"
      ],
      "related_proj": [
        80,
        61,
        36
      ]
    },
    {
      "student_name": "Mike S.",
      "mentor_name": "Matthew Radzihovsky",
      "mentor_title": "Computer Science MS from Stanford, AI/ML Engineer at Apple",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Using Machine Learning Architecture to Detect Brain Tumors",
      "project_desc": "Magnetic Resonance Imaging (MRI) scans are the primary way medical professionals study the brain. Doctors are trained to identify irregular cell growth patterns and notify patients if they have or are at risk of cancer. Identifying tumors before they become malignant saves both resources and welfare of patients. In this paper, we apply a basic SKLearn Logistic Regression model, a custom Convolutional Neural Network model, and a transfer learning model based on the VGG16 model to automatically diagnose malignant or benign tumors in MRI scans. We found that the VGG16 model performed the best, with a validation accuracy of 91.6%. Logistic Regression had a validation accuracy of 82.3% and CNN an accuracy of 83.2%. These promising results suggest that automated machine learning models can be used as a MRI scan analyzer to diagnose patients more often and more quickly which may have the ability to identify tumors before they become malignant, saving lives.",
      "research_paper": "assets/pdfs/9b4c949205be279ffa61b4678e8e0dacebe2e815.pdf",
      "graphic_link": "http://www.roswellpark.org/sites/default/files/shutterstock_44859535.jpg",
      "headline": "Not all tumors in the brain are cancerous, so irregular cell growths can often be determined as benign and are ignored completely. However, many of these low-danger cell growths can develop into higher-danger cancerous tumors. Identifying these low-danger tumors early is key to preventing cancer in the future.",
      "project_id": "358df9da416a0cea3a9ae9e2232c1b6fd978dde5",
      "expand": false,
      "tags": [
        "Cancer",
        "Brain Cancer",
        "Diseases and Health Conditions"
      ],
      "related_proj": [
        47,
        22,
        12
      ]
    },
    {
      "student_name": "Harrison S.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/eca0414bcb5f9f26f301192ee3b2c2f4dfcb036c.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Stock Price Prediction",
      "project_desc": "\n\tThe goal of the project is to create an advanced model that formulates stock predictions based on past economic data. Models such as these have become commonly used for trades by large firms because of the quick and mathematical thinking the algorithm can use to predict small, short term changes in stock prices. Sixty to seventy five percent of trading is done through algorithms using artificial intelligence which accounts for hundreds of billions of dollars of transactions every single day. The strength of the algorithm is only as good as the people who build it, so understanding how the market works is important for judging whether the algorithm works how it should. Using different machine learning algorithms, technical information about stocks is fed in to try to produce low amounts of error in stock price predictions. Based on top technical metrics used for trading determined by Bloomberg(an investing software), evaluation of the market as whole, and buyer sentiment analysis through different news sources, the algorithm will try to formulate a pattern that best predicts the outcome for the next day. The best results achieved by the different algorithms were .8% error, or average difference between predicted and actual stock price, and 1.1% error. \n",
      "research_paper": "assets/pdfs/b07801073f0012aa7ce4bc14da97721c595d4095.pdf",
      "graphic_link": "https://miro.medium.com/max/1200/0*R5pC0bAlYxH_nTlF.jpg",
      "headline": "The most advanced stock prediction models take into account fundamental and technical analysis. Fundamental analysis involves analyzing the stock’s intrinsic value, financial statements, tangible assets, management effectiveness, consumer behavior, and overall company outlook.",
      "project_id": "96ee45662ccb6662c9f8d6b4bb6c52c44849566c",
      "expand": false,
      "tags": [
        "Stocks",
        "Economics"
      ],
      "related_proj": [
        11,
        25,
        50
      ]
    },
    {
      "student_name": "Bertran M.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Psychology",
        "Education"
      ],
      "project_title": "Detecting Facial Expressions",
      "project_desc": "The research question put forward by this paper is “To what extent can emotion detection artificial intelligence algorithms be used in order to improve education, business success, employee safety, healthcare and video game testing?” This paper looks to be able to give the consumers of the solution the ability to pinpoint which emotions educators, healthcare workers, video game testers and consumers of their business are feeling in order to improve their quality. In all of the areas that have been previously mentioned, there is a large inability to be able to identify when certain workers are feeling certain emotions, as a result of lack of recall memory, lack of honesty, or simply lack of awareness. In order to identify the satisfaction and dissatisfaction of healthcare workers, educators, video game testers and consumers of a business at certain moments, the quality of healthcare, education, video games and business websites will all increase respectively by being able to identify when workers are feeling a certain way, and how to reinforce or reduce the emotions being felt during those moments. \nIn order to solve this problem, many classification algorithms will be explored, such as convolutional neural networks, K nearest neighbor, multi-layer perceptron classifier, amongst many others. These classification algorithms will look for a successful and quality classification of the images being presented in order to ensure excellence whenever this solution is implemented in the areas mentioned previously. \n\tBy using the algorithms mentioned previously, the accuracy of the model was significantly higher than what it would have been had it been chosen randomly. For instance, with a convolutional neural network, there was an accuracy of 25%, whereas random assignment would have had a success rate of 14.29%\nThe conclusions from this investigation are that artificial intelligence algorithms can be used in order to classify images into 7 categories according to the emotion being displayed on them, and this solution can and will be successfully implemented into the areas mentioned previously. \n",
      "research_paper": "assets/pdfs/aa2e01c84ca3e24e1bb376ba5988cfc10d831d4d.pdf",
      "graphic_link": "https://post.psychcentral.com/wp-content/uploads/sites/4/2021/07/young-man-portrait-looking-at-camera-blank-expression-1200x628-facebook-1200x628.jpg",
      "headline": "This paper shows that machine learning algorithms can be used in order to classify emotions into different categories. The most promising results were from the K-nearest neighbor model, with 61.5% accuracy in the training set, and 32.1% accuracy in the testing set.",
      "project_id": "eb645ba3e84ff785a70b7e6d92d0b9aacab60af8",
      "expand": false,
      "tags": [
        "Psych"
      ],
      "related_proj": [
        9,
        34,
        3
      ]
    },
    {
      "student_name": "Fiona B.",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Using Machine Learning Models to Determine Medical Features Most Indicative of Gestational Diabetes",
      "project_desc": "Since not all females in America have access to abortions, my research is important because it can lead to ways to minimize dangerous and potentially fatal risks in pregnancies. Gestational diabetes is a type of diabetes that develops during pregnancy that can lead to many health concerns for both the mother and fetus. Machine learning classification can take many different features or inputs to guess what the output should be, so in the case of gestational diabetes, in a ML were given many medical features and had to predict what the outcome could be, someone could figure out what the ML thought was most important, and that could be an indicator of what medical factors are closely connected with a disease. I used four different machine learning models to each predict if a patient given a list of their medical features had gestational diabetes. I then found out which features the models relied on to make their guess in order to determine the most indicative medical factors. All models agreed that glucose was a medical factor that they relied on to make their predictions. Two different models had the exact same three features: glucose, BMI, and age. In conclusion, if medical professionals know that these three factors are most indicative of someone developing gestational diabetes, then these areas can be targeted when someone is trying to get pregnant to minimize the likelihood of developing gestational diabetes.",
      "graphic_link": "https://assets.medpagetoday.net/media/images/100xxx/100274.jpg",
      "headline": "With the recent overruling of Roe v. Wade, pregnancies have become especially dangerous since many females who previously abort fetuses no longer can. By doing this research project, I can help figure out what medical factors may lead to gestational diabetes, and hopefully from there, the results can be used to counteract those features.",
      "project_id": "5e84d8f6b96a6f4606997b2bff26e36a6635f559",
      "expand": true,
      "tags": [
        "Diseases and Health Conditions",
        "Diabetes"
      ],
      "related_proj": [
        47,
        75,
        71
      ]
    },
    {
      "student_name": "Adam S.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/d87ff4ded1201c69e2b048780db273cfea43b324.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Identifying Cancer Types in Microscope Images of Lung and Colon Cells",
      "project_desc": "This program seeks to reach a high accuracy of detecting types of cancer in addition to whether or not cells are benign. The model categorizes the cell images into 5 classes: benign colon, benign lung, cancerous lung adenocarcinoma, cancerous colon adenocarcinoma, and cancerous lung squamous cell carcinoma. Two models are then trained with the images: a random forest classifier, and a deep neural network using convolutional layers. Finally a third model predicts which classifier is more likely to make the correct prediction for a given image, and that classifier’s prediction is used. This tactic allows the models to learn different patterns, but still be effective at predicting all classes of images.\n",
      "research_paper": "assets/pdfs/4f7ae05d6bc184d7be2a9bed0b3fb13d758df0fe.pdf",
      "graphic_link": "https://www.pulmonologyadvisor.com/wp-content/uploads/sites/21/2019/02/chestxrayscang869879614_1362374.jpg",
      "headline": "Lung adenocarcinoma cells make up large proportions of lung cancer cases and colon cancer is one of the most prevalent cancers in the United States. Although many different medicines have been recently developed to attack these cancers, the most effective way to stop it is early detection.",
      "project_id": "ead7c7979987656fc00f4364ca8cbc9d2331b23e",
      "expand": false,
      "tags": [
        "Cancer",
        "Diseases and Health Conditions",
        "Lung Cancer"
      ],
      "related_proj": [
        67,
        71,
        41
      ]
    },
    {
      "student_name": "Leah N.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/f8431ef22e13e936dde5c81829e2576838ef2cb1.png",
      "domains": [
        "Healthcare and Biology"
      ],
      "project_title": "Developing an Accurate AI Algorithm for Histopathologic Cancer Detection",
      "project_desc": "\tThis paper discusses the development of a machine learning algorithm that accurately detects metastatic breast cancer (the cancer has spread elsewhere from its origin part) in select images that come from pathology scans of lymph node sections. Being able to develop an accurate artificial intelligence (AI) algorithm would help significantly in breast cancer diagnosis since manual examination of lymph node scans is both tedious and oftentimes highly subjective. The usage of AI in the diagnosis process provides a much more straightforward, reliable, and efficient method for medical professionals and would enable faster diagnosis and, therefore, more immediate treatment. The overall approach used was to train a convolution neural network (CNN) based on a set of pathology scan data and using the trained model to binarily classify if a new scan were benign or malignant, outputting a 0 or a 1, respectively. The final model’s prediction accuracy is very high, with 100% for the train set and over 70% for the test set. Being able to have such high accuracy using an AI model is monumental in regards to medical pathology and cancer detection. Having AI as a new tool capable of quick detection will significantly help medical professionals and patients suffering from cancer.",
      "research_paper": "assets/pdfs/8a5e8935253f9eab111645e70bd509856ac1b1f8.pdf",
      "graphic_link": "https://miro.medium.com/max/800/1*0YHaGNOMIhZaHkZ7RR-FFQ.jpeg",
      "headline": "In this specific research project, we will be focusing on the lymph node scans of women with breast cancer, which is the most common cancer for women residing in the US, other than skin cancer. Research statistics show that about 1 in 8 women in the United States will develop invasive breast cancer throughout her life.",
      "project_id": "497d2dfb6fdc004c66430347d7e0e2026a04d6c5",
      "expand": false,
      "tags": [
        "Cancer",
        "Diseases and Health Conditions"
      ],
      "related_proj": [
        74,
        37,
        51
      ]
    },
    {
      "student_name": "Molly H.",
      "mentor_name": "Sharon Chen",
      "mentor_title": "Electrical Engineering and Neuroscience MS from Caltech",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/missing_image.png",
      "domains": [
        "Environment",
        "Humanitarian Efforts and Social Justice"
      ],
      "project_title": "Identifying Parameters in Water Potability Analysis Through Machine Learning",
      "project_desc": "Machine learning has become a rapid and prevalent tool in the growth of environmental science. With the onset of emerging data, data analysts have relied on ML models to reveal hidden trends. In past papers, machine learning has been brought up countless times as an innovative method to rapidly sort through data in big groups. However, developing an artificial neural network model is a sparsely used tool in research due to its lack of human interface, risk factors, and not enough experimentation in real-life applications. In this research, we implemented multiple ANN models to identify factors in a water’s chemical levels to identify which has the largest weight or bias in determining whether the water is potable or not. Subsequently, we created a model that uses these parameters to analyze and predict whether a water source will be safe to drink. Water is an essential resource for all beings on Earth, and as the climate changes, the water levels rise, and along comes pollutants to once safe drinking water. By comparing the accuracy between both classifier and regressor ML models, each model was hyper-parameterized to develop a better accuracy, as well as identify the weight each parameter carries towards the potability of the source. The results demonstrate a promising conclusion that the number of solids affects the potability versus other chemical levels. That said, there was not a strong, distinct correlation and every factor plays an important part. The accuracy of these models returned a sub-par 64.77% accuracy with a 0.53 precision, a 0.46 recall score, and a 0.49 f1 score. In conclusion, while the accuracy of the models is ineffective to be used just yet on a bigger scale, they offer a stepping stone in the development of machine learning models in the environmental science fields, resourcing digital infrastructures to analyze and dissect the Earth and its trajectory through climate changes.",
      "research_paper": "assets/pdfs/351f19c3c6efe36fbd516eddb955f804b55c3aaa.pdf",
      "graphic_link": "https://www.prominent.com/media/References/potable-water-stadtwerke-arnsberg_Header_1.jpg",
      "headline": "Predicting whether the water is potable or not can be helpful for people who are reliant on bodies of water and redirect them to safer options. It will also be beneficial to apply the algorithm to other places where it is expensive and inefficient to send people out and collect water samples. Over the past couple of decades, researchers have often commented on the lack of funding as a source of error when it comes to data analysis and the accuracy of the research.",
      "project_id": "6fa1b51e4ed9c740192fc78b3337892731c0a76a",
      "expand": true,
      "tags": [
        "Earth Systems",
        "Water Use"
      ],
      "related_proj": [
        39,
        79,
        80
      ]
    },
    {
      "student_name": "Sai P.",
      "mentor_name": "Odysseas Drosis",
      "mentor_title": "PhD Candidate in Computer Science, Masters in Computer Science Alum from Cornell",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/f934c29fb92753d7d8977be2a57a56c672efe340.png",
      "domains": [
        "Business and Finance"
      ],
      "project_title": "Stock Price Prediction",
      "project_desc": "The main research problem here is how we are using python and other algorithms for Stock predictions. In this project, we are trying to write code using any company and predicting its values/prices. The context of this problem is to build a code to predict stocks as when there is a person manually working on stocks it could take him time and the stock price could change in a matter of seconds.",
      "research_paper": "assets/pdfs/b11c5d594ed2fd9330e88547f3bd9e6154ebbed0.pdf",
      "graphic_link": "https://miro.medium.com/max/626/0*SaNg8uUaKCMQSS5g.jpg",
      "headline": "In my project, I used two different methods, the linear model and the neural network. These two were a big part of my project as they involved a pattern for my values while predicting future stocks. The linear model basically uses the relationship between the data points to draw a straight line through all of them. This line can be used to predict future values.",
      "project_id": "c14c7251dc3554e8ca0c48e56b3e46ed3da1c018",
      "expand": false,
      "tags": [
        "Stocks",
        "Economics"
      ],
      "related_proj": [
        0,
        14,
        66
      ]
    },
    {
      "student_name": "Sohum T.",
      "mentor_name": "Akshay Jagadeesh",
      "mentor_title": "Computational Neuroscience PhD from Stanford",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/35b5cd5154861fba41f499203d1b1081eae4cbb1.png",
      "domains": [
        "Psychology",
        "Humanitarian Efforts and Social Justice"
      ],
      "project_title": "How Does One’s Background Determine Their Mental State?",
      "project_desc": "Is there a correlation between one’s mental health status and one’s Age, Family History, Workplace Environment, or other aspects about one’s life? This paper answers this question by using responses to a survey that over 1000 people took. The participants of this survey were of diverse backgrounds and had varying answers. Models such as Logistic Regression, the Decision Tree Classifier, and the SVC model were used to produce correlations. The results indicate that there is a positive correlation between one’s family history of mental health and one’s current mental state, and that there is a negative correlation between one’s work interference and one’s current mental state, among others.",
      "research_paper": "assets/pdfs/44369ac3047fac0f55d7d730ab7b8c465404cb6a.pdf",
      "graphic_link": "https://hbr.org/resources/images/article_assets/2018/10/Oct22_18_862457080.png",
      "headline": "Mental health issues have become very prevalent in recent times, and although significant progress has been made in terms of treatment in the form of counseling, medication, and other methods, in order to truly find out the root cause of many mental health issues, a correlation has to be drawn between one’s mental state and another factor, such as family history, age, work environment, etc. It is also beneficial to correlate one’s mental state with a multitude of factors to see the compilation.",
      "project_id": "6021eb4f2c7e1f36f6d75c3ba4ea1a05c93bcc50",
      "expand": false,
      "tags": [
        "Mental Health",
        "Psych"
      ],
      "related_proj": [
        49,
        38,
        3
      ]
    },
    {
      "student_name": "Sophia G.",
      "mentor_image": "assets/images/missing_image.png",
      "student_image": "assets/images/student_imgs/8b889dd53b0841698abc1253aae2f3a1b368ddf3.png",
      "domains": [
        "Humanitarian Efforts and Social Justice",
        "Published Papers"
      ],
      "project_title": "A Machine Learning Approach to Understanding the Determining Factors of the Gender Wage Gap",
      "project_desc": "Gender inequality is a complex subject consisting of a variety of issues and nuances. In this project, we choose to study gender income inequality—a prevalent issue in current society. Among the many factors that play a role in the gender wage gap, we focus on the affects of marital status, race, geographical location (by state), age, and years of education. By using these variables to create a model able to predict the hourly wage gap between a woman and their equivalent male counterpart, we can analyze the impact of each variable to better understand the role they play in the income gap. Utilizing income data from the Current Population Survey, we train and test five models—a Linear Regression, Decision Tree Regressor, Random Forest Regressor, KNeighbors Regressor, and MLP Regressor. Our Linear Regression model found that there is a correlation between being a never married worker and a smaller gender wage gap, as well as being a married worker with an absent spouse and a greater gender wage gap. In general, though, our models found little correlation between the variables provided and the predicted hourly age gap. \n",
      "research_paper": "assets/pdfs/4c2dec4fb3c31bc305c9008eb6addb04d1747d92.pdf",
      "github": "https://github.com/sophiaguan/genderwagegapanalysis",
      "graphic_link": "http://media.wbur.org/wp/2016/04/0416_oag-pay-21-1000x666.jpg",
      "headline": " By studying the affect of different attributes on the gender wage gap, we can better understand both the scale of this issue and its possible solutions. So, we explore the question, how does a worker’s marital status, along with other variables, impact the gap in hourly wage between male and female workers? We seek to create a model able to predict the gender wage gap given a set of variables—age, years of education, race, state, and marital status.",
      "project_id": "0a574bde2fff76c3dafb371ae2cef1cfbd7ed854",
      "expand": true,
      "tags": [
        "Wage Gap",
        "Economics",
        "Published",
        "Science Fairs"
      ],
      "related_proj": [
        77,
        79,
        52
      ]
    }
  ],
  "topics": [
    "Business and Finance",
    "Education",
    "Engineering",
    "Environment",
    "Healthcare and Biology",
    "Humanitarian Efforts and Social Justice",
    "Journalism",
    "Language and Literature",
    "Misc",
    "Physics",
    "PoliSci and Law",
    "Psychology",
    "Published Papers",
    "Specific Technologies"
  ],
  "tags": [
    "App Development",
    "Astronomy",
    "BERT",
    "Biology",
    "Brain Cancer",
    "CNNs",
    "COVID-19",
    "Cancer",
    "Chemicals",
    "Chemistry",
    "Classification",
    "Climate Change",
    "Consumer Behavior",
    "Criminal Justice",
    "DNA",
    "Depression",
    "Diabetes",
    "Diseases and Health Conditions",
    "Dropout Rates",
    "Drug Overdose",
    "Drugs",
    "EOL",
    "Earth Systems",
    "Economics",
    "Education",
    "Environmentalism",
    "Eyes",
    "Facial Emotion",
    "Fake News",
    "Farming",
    "Fencing",
    "Forest Fires",
    "Fraud",
    "GHGs",
    "GPT-3",
    "Gamma Rays",
    "Gender Equality",
    "Generative AI",
    "Google",
    "Inequality",
    "Irrigation",
    "Kinematics",
    "LSTMs",
    "Law and Order",
    "Leukemia",
    "Logistic Regression",
    "Lung Cancer",
    "Mental Health",
    "Microfinance",
    "Modern Languages",
    "Natural Disasters",
    "Natural Language Processing",
    "Neuroscience",
    "New York",
    "News",
    "Options",
    "Physics",
    "Physiology",
    "Plants",
    "Pneumonia",
    "Pollution",
    "Pop Culture",
    "Prediction",
    "Psych",
    "Published",
    "Racial Equality",
    "Random Forests",
    "Real Estate",
    "Recidivism",
    "Recycling",
    "Renewable Energy",
    "Running",
    "Satellite Imagery",
    "Science Fairs",
    "Skin Cancer",
    "Social Justice",
    "Social Media",
    "Solar Cycles",
    "Solar Flares",
    "Solar Power",
    "Sports",
    "Standardized Testing",
    "Star Clusters",
    "Stellar Classification",
    "Stocks",
    "Visual Arts",
    "Vollyball",
    "Wage Gap",
    "Water",
    "Water Use",
    "Weather",
    "Web Deployment",
    "Web Development",
    "Wildlife",
    "Writing"
  ],
  "tagsMap": {
    "Business and Finance": [
      "Consumer Behavior",
      "Economics",
      "Fraud",
      "Microfinance",
      "Options",
      "Real Estate",
      "Stocks"
    ],
    "Education": [
      "Dropout Rates",
      "Education",
      "Psych",
      "Standardized Testing"
    ],
    "Engineering": [
      "Autonomous Vehicles",
      "Control Systems",
      "Engineering",
      "Optimization",
      "Recycling"
    ],
    "Environment": [
      "Chemicals",
      "Climate Change",
      "Earth Systems",
      "Farming",
      "Forest Fires",
      "GHGs",
      "Irrigation",
      "Natural Disasters",
      "Plants",
      "Pollution",
      "Renewable Energy",
      "Water",
      "Water Use",
      "Weather",
      "Wildlife"
    ],
    "Healthcare and Biology": [
      "Biology",
      "Brain Cancer",
      "COVID-19",
      "Cancer",
      "DNA",
      "Diabetes",
      "Diseases and Health Conditions",
      "Drug Overdose",
      "Drugs",
      "Eyes",
      "Heart Disease",
      "Leukemia",
      "Lung Cancer",
      "Mental Health",
      "Neuroscience",
      "Physiology",
      "Pneumonia",
      "Skin Cancer"
    ],
    "Humanitarian Efforts and Social Justice": [
      "Criminal Justice",
      "Drug Overdose",
      "Fake News",
      "Gender Equality",
      "Inequality",
      "Law and Order",
      "Mental Health",
      "Racial Equality",
      "Recidivism",
      "Social Justice",
      "Wage Gap"
    ],
    "Journalism": [
      "Fake News",
      "News"
    ],
    "Language and Literature": [
      "Fake News",
      "GPT-3",
      "Modern Languages",
      "Natural Language Processing",
      "News",
      "Writing"
    ],
    "Physics": [
      "Astronomy",
      "Gamma Rays",
      "Kinematics",
      "Physics",
      "Solar Cycles",
      "Solar Flares",
      "Star Clusters"
    ],
    "PoliSci and Law": [
      "Criminal Justice",
      "Law and Order",
      "Recidivism"
    ],
    "Psychology": [
      "Depression",
      "Facial Emotion",
      "Mental Health",
      "Psych"
    ],
    "Specific Technologies": [
      "App Development",
      "BERT",
      "CNNs",
      "Classification",
      "EOL",
      "GPT-3",
      "Generative AI",
      "Google",
      "LSTMs",
      "Logistic Regression",
      "Natural Language Processing",
      "Object Detection Models",
      "Prediction",
      "Q Learning",
      "Reinforcement Learning",
      "Web Development"
    ],
    "Misc": [
      "Fencing",
      "Music",
      "New York",
      "Pop Culture",
      "Running",
      "Social Media",
      "Sports",
      "Visual Arts",
      "Vollyball"
    ],
    "Published Papers": [
      "Published",
      "Science Fairs"
    ]
  }
}